[
  {
    "cmc": 6, 
    "colorIdentity": [
      "R"
    ], 
    "colors": [
      "Red"
    ], 
    "imageName": "chandra, flamecaller", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Battle for Zendikar Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Standard", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{4}{R}{R}", 
    "name": "Chandra, Flamecaller", 
    "printings": [
      "OGW"
    ], 
    "rulings": [
      {
        "date": "2016-01-22", 
        "text": "You can activate Chandra's second ability while you have an empty hand. If you do, you'll draw one card."
      }, 
      {
        "date": "2016-04-08", 
        "text": "For Chandra's second ability, it doesn't matter if the cards don't go to your graveyard because of a replacement effect. For example, cards with madness discarded this way will still count toward the number of cards you discarded."
      }
    ], 
    "subtypes": [
      "Chandra"
    ], 
    "text": "+1: Create two 3/1 red Elemental creature tokens with haste. Exile them at the beginning of the next end step.\n0: Discard all the cards in your hand, then draw that many cards plus one.\n−X: Chandra, Flamecaller deals X damage to each creature.", 
    "type": "Planeswalker — Chandra", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 5, 
    "colorIdentity": [
      "U"
    ], 
    "colors": [
      "Blue"
    ], 
    "imageName": "tezzeret the seeker", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Shards of Alara Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{3}{U}{U}", 
    "name": "Tezzeret the Seeker", 
    "printings": [
      "ALA", 
      "DDF", 
      "MM2"
    ], 
    "rulings": [
      {
        "date": "2008-10-01", 
        "text": "The first ability can target zero, one, or two artifacts. You may activate it with no targets just to put a loyalty counter on Tezzeret."
      }, 
      {
        "date": "2008-10-01", 
        "text": "For the second ability, you choose the value of X when you activate it. You don't look through your library until the ability resolves. (In other words, you can't look through your library, decide what artifact card you want, and then determine what X is.) You can't choose an X that's greater than the number of loyalty counters on Tezzeret."
      }, 
      {
        "date": "2008-10-01", 
        "text": "The third ability affects all artifacts you control, including artifacts that are already creatures."
      }, 
      {
        "date": "2008-10-01", 
        "text": "The third ability causes artifacts you control to become creatures in addition to their other card types."
      }, 
      {
        "date": "2009-10-01", 
        "text": "A noncreature permanent that turns into a creature is subject to the \"summoning sickness\" rule: It can only attack, and its {T} abilities can only be activated, if its controller has continuously controlled that permanent since the beginning of his or her most recent turn."
      }, 
      {
        "date": "2009-10-01", 
        "text": "The effect from the ability overwrites other effects that set power and/or toughness if and only if those effects existed before the ability resolved. It will not overwrite effects that modify power or toughness (whether from a static ability, counters, or a resolved spell or ability), nor will it overwrite effects that set power and toughness which come into existence after the ability resolves. Effects that switch the creature's power and toughness are always applied after any other power or toughness changing effects, including this one, regardless of the order in which they are created."
      }
    ], 
    "subtypes": [
      "Tezzeret"
    ], 
    "text": "+1: Untap up to two target artifacts.\n−X: Search your library for an artifact card with converted mana cost X or less and put it onto the battlefield. Then shuffle your library.\n−5: Artifacts you control become artifact creatures with base power and toughness 5/5 until end of turn.", 
    "type": "Planeswalker — Tezzeret", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "W", 
      "B"
    ], 
    "colors": [
      "White", 
      "Black"
    ], 
    "imageName": "sorin, lord of innistrad", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Innistrad Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{2}{W}{B}", 
    "name": "Sorin, Lord of Innistrad", 
    "printings": [
      "DKA", 
      "DDK"
    ], 
    "rulings": [
      {
        "date": "2011-01-22", 
        "text": "The emblems are cumulative. If you get two of them, creatures you control will get +2/+0."
      }, 
      {
        "date": "2011-01-22", 
        "text": "You can target a token creature with Sorin, Lord of Innistrad's third ability, but it won't return to the battlefield."
      }, 
      {
        "date": "2011-01-22", 
        "text": "If a creature with undying is destroyed by Sorin, Lord of Innistrad's third ability, the undying ability will trigger, but the creature will already have been returned to the battlefield by Sorin. The undying ability won't do anything when it resolves."
      }, 
      {
        "date": "2011-01-22", 
        "text": "If Sorin, Lord of Innistrad somehow becomes a creature, it can be chosen as a target of its own third ability. If Sorin, Lord of Innistrad is still on the battlefield when that ability resolves, it will then destroy Sorin and return him to the battlefield under your control."
      }
    ], 
    "subtypes": [
      "Sorin"
    ], 
    "text": "+1: Create a 1/1 black Vampire creature token with lifelink.\n−2: You get an emblem with \"Creatures you control get +1/+0.\"\n−6: Destroy up to three target creatures and/or other planeswalkers. Return each card put into a graveyard this way to the battlefield under your control.", 
    "type": "Planeswalker — Sorin", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 5, 
    "colorIdentity": [
      "R"
    ], 
    "colors": [
      "Red"
    ], 
    "imageName": "sarkhan, the dragonspeaker", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Khans of Tarkir Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{3}{R}{R}", 
    "name": "Sarkhan, the Dragonspeaker", 
    "printings": [
      "KTK"
    ], 
    "rulings": [
      {
        "date": "2014-09-20", 
        "text": "If Sarkhan, the Dragonspeaker becomes a creature due to his first ability, that doesn't count as having a creature enter the battlefield. Sarkhan was already on the battlefield; he only changed his types. Abilities that trigger whenever a creature enters the battlefield won't trigger."
      }, 
      {
        "date": "2014-09-20", 
        "text": "Any loyalty counters on Sarkhan when his first ability resolves will remain on him while he's a creature. Because he's not a planeswalker at this time, damage dealt to him won't cause those counters to be removed."
      }, 
      {
        "date": "2014-09-20", 
        "text": "After the first ability resolves, Sarkhan won't be a planeswalker until the end of the turn. Later that turn, if you cast another Sarkhan, the Dragonspeaker, neither permanent will be put into its owner's graveyard. The \"legend rule\" sees only the original Sarkhan and the \"planeswalker uniqueness rule\" sees only the new Sarkhan. However, if you activate the first ability of the new Sarkhan, you would then control two legendary permanents with the same name. You'd choose one to remain on the battlefield and the other would be put into its owner's graveyard. If you don't activate the first ability of the new Sarkhan, the original Sarkhan will return to being a planeswalker during the cleanup step. You would then control two planeswalkers with the same planeswalker type. You'd choose one to remain on the battlefield and the other would be put into its owner's graveyard. There would then be another cleanup step before the turn ended."
      }, 
      {
        "date": "2014-09-20", 
        "text": "If a permanent enters the battlefield as a copy of Sarkhan after his first ability has resolved, the copy will be a Sarkhan planeswalker. It will enter the battlefield with four loyalty counters, no matter how many loyalty counters are on the original Sarkhan. You'll then find yourself in the same situation described above."
      }
    ], 
    "subtypes": [
      "Sarkhan"
    ], 
    "text": "+1: Until end of turn, Sarkhan, the Dragonspeaker becomes a legendary 4/4 red Dragon creature with flying, indestructible, and haste. (He doesn't lose loyalty while he's not a planeswalker.)\n−3: Sarkhan, the Dragonspeaker deals 4 damage to target creature.\n−6: You get an emblem with \"At the beginning of your draw step, draw two additional cards\" and \"At the beginning of your end step, discard your hand.\"", 
    "type": "Planeswalker — Sarkhan", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "W"
    ], 
    "colors": [
      "White"
    ], 
    "imageName": "gideon, ally of zendikar", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Battle for Zendikar Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Standard", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{2}{W}{W}", 
    "name": "Gideon, Ally of Zendikar", 
    "printings": [
      "pPRE", 
      "BFZ"
    ], 
    "rulings": [
      {
        "date": "2015-08-25", 
        "text": "Gideon's first ability doesn't count as a creature entering the battlefield. Gideon was already on the battlefield; he only changed his types. Specifically, your rally abilities won't trigger. (Of course, Gideon's second ability will cause rally abilities to trigger.)"
      }, 
      {
        "date": "2015-08-25", 
        "text": "If Gideon becomes a creature the same turn he enters the battlefield, you can't attack with him or use any of his {T} abilities (if he gains any)."
      }, 
      {
        "date": "2015-08-25", 
        "text": "Gideon's first ability causes him to become a creature with the creature types Human, Soldier, and Ally. He remains a planeswalker with the planeswalker type Gideon. (He also retains any other card types or subtypes he may have had.) Each subtype is correlated to the proper card type: planeswalker is only a type (not a creature type), and Human, Soldier, and Ally are just creature types (not planeswalker types)."
      }, 
      {
        "date": "2015-08-25", 
        "text": "If damage that can't be prevented is dealt to Gideon after his first ability has resolved, that damage will have all applicable results: specifically, the damage is marked on Gideon (since he's a creature) and that damage causes that many loyalty counters to be removed from him (since he's a planeswalker). Even though he has indestructible, if Gideon has no loyalty counters on him, he's put into his owner's graveyard."
      }
    ], 
    "subtypes": [
      "Gideon"
    ], 
    "text": "+1: Until end of turn, Gideon, Ally of Zendikar becomes a 5/5 Human Soldier Ally creature with indestructible that's still a planeswalker. Prevent all damage that would be dealt to him this turn.\n0: Create a 2/2 white Knight Ally creature token.\n−4: You get an emblem with \"Creatures you control get +1/+1.\"", 
    "type": "Planeswalker — Gideon", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "B", 
      "G"
    ], 
    "colors": [
      "Green"
    ], 
    "imageName": "garruk relentless", 
    "layout": "double-faced", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Innistrad Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{3}{G}", 
    "name": "Garruk Relentless", 
    "names": [
      "Garruk Relentless", 
      "Garruk, the Veil-Cursed"
    ], 
    "printings": [
      "ISD"
    ], 
    "rulings": [
      {
        "date": "2011-09-22", 
        "text": "Garruk Relentless's first ability is a state-triggered ability. It triggers once Garruk has two or fewer loyalty counters on him and it can't retrigger while that ability is on the stack."
      }, 
      {
        "date": "2011-09-22", 
        "text": "You don't add or remove loyalty counters from Garruk Relentless when he transforms into Garruk, the Veil-Cursed. In most cases, he'll have one or two loyalty counters on him."
      }, 
      {
        "date": "2011-09-22", 
        "text": "You can't activate a loyalty ability of Garruk Relentless and later that turn after he transforms activate a loyalty ability of Garruk, the Veil-Cursed."
      }, 
      {
        "date": "2016-07-13", 
        "text": "For more information on double-faced cards, see the Shadows over Innistrad mechanics article (http://magic.wizards.com/en/articles/archive/feature/shadows-over-innistrad-mechanics)."
      }
    ], 
    "subtypes": [
      "Garruk"
    ], 
    "text": "When Garruk Relentless has two or fewer loyalty counters on him, transform him.\n0: Garruk Relentless deals 3 damage to target creature. That creature deals damage equal to its power to him.\n0: Create a 2/2 green Wolf creature token.", 
    "type": "Planeswalker — Garruk", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 7, 
    "imageName": "karn liberated", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Scars of Mirrodin Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 6, 
    "manaCost": "{7}", 
    "name": "Karn Liberated", 
    "printings": [
      "NPH", 
      "MM2"
    ], 
    "rulings": [
      {
        "date": "2011-06-01", 
        "text": "Karn's first and third abilities are linked. Similarly, Karn's second and third abilities are linked. Only cards exiled by either of Karn's first two abilities will remain in exile when the game restarts."
      }, 
      {
        "date": "2011-06-01", 
        "text": "A game that restarts immediately ends. The players in that game then immediately begin a new game. No player wins, loses, or draws the original game as a result of Karn's ability."
      }, 
      {
        "date": "2011-06-01", 
        "text": "In a multiplayer games (a game that started with three or more players in it), any player that left the game before it was restarted with Karn's ability won't be involved in the new game."
      }, 
      {
        "date": "2011-06-01", 
        "text": "The player who controlled the ability that restarted the game is the starting player in the new game. The new game starts like a game normally does: -- Each player shuffles his or her deck (except the cards left in exile by Karn's ability). -- Each player's life total becomes 20 (or the starting life total for whatever format you're playing). -- Players draw a hand of seven cards. Players may take mulligans. -- Players may take actions based on cards in their opening hands, such as Chancellors and Leylines."
      }, 
      {
        "date": "2011-06-01", 
        "text": "After the pre-game procedure is complete, but before the new game's first turn, Karn's ability finishes resolving and the cards left in exile are put onto the battlefield. If this causes any triggered abilities to trigger, those abilities are put onto the stack at the beginning of the first upkeep step."
      }, 
      {
        "date": "2011-06-01", 
        "text": "Creatures put onto the battlefield due to Karn's ability will have been under their controller's control continuously since the beginning of the first turn. They can attack and their activated abilities with {T} in the cost can be activated."
      }, 
      {
        "date": "2011-06-01", 
        "text": "Any permanents put onto the battlefield with Karn's ability that entered the battlefield tapped will untap during their controller's first untap step."
      }, 
      {
        "date": "2011-06-01", 
        "text": "No actions taken in the game that was restarted apply to the new game. For example, if you were dealt damage by Stigma Lasher in the original game, the effect that states you can't gain life doesn't carry over to the new game."
      }, 
      {
        "date": "2011-06-01", 
        "text": "Players won't have any poison counters or emblems they had in the original game."
      }, 
      {
        "date": "2011-06-01", 
        "text": "In a Commander game, players put their commanders into the command zone before shuffling their deck."
      }, 
      {
        "date": "2011-06-01", 
        "text": "The number of times a player has cast his or her commander from the command zone resets to zero. Also, the amount of combat damage dealt to players by each commander is reset to 0."
      }, 
      {
        "date": "2011-06-01", 
        "text": "If a player's commander was exiled with Karn at the game restarted, that commander won't be put into the command zone at the beginning of the game. It will be put onto the battlefield when Karn's ability finishes resolving."
      }, 
      {
        "date": "2011-06-01", 
        "text": "In a multiplayer game using the limited range of influence option, all players are affected and will restart the game, not just those within the range of influence of the ability's controller."
      }
    ], 
    "subtypes": [
      "Karn"
    ], 
    "text": "+4: Target player exiles a card from his or her hand.\n−3: Exile target permanent.\n−14: Restart the game, leaving in exile all non-Aura permanent cards exiled with Karn Liberated. Then put those cards onto the battlefield under your control.", 
    "type": "Planeswalker — Karn", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 5, 
    "colorIdentity": [
      "G"
    ], 
    "colors": [
      "Green"
    ], 
    "imageName": "nissa, worldwaker", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{3}{G}{G}", 
    "name": "Nissa, Worldwaker", 
    "printings": [
      "pMEI", 
      "M15"
    ], 
    "rulings": [
      {
        "date": "2014-07-18", 
        "text": "The type-changing effects of the first and third abilities don't have a duration. They last indefinitely."
      }, 
      {
        "date": "2014-07-18", 
        "text": "If the land targeted by the first ability entered the battlefield this turn, it won't be able to attack and its activated abilities with {T} in the cost (including its mana ability) can't be activated (unless something gives it haste). The same is true for the lands put onto the battlefield with the third ability."
      }
    ], 
    "subtypes": [
      "Nissa"
    ], 
    "text": "+1: Target land you control becomes a 4/4 Elemental creature with trample. It's still a land.\n+1: Untap up to four target Forests.\n−7: Search your library for any number of basic land cards, put them onto the battlefield, then shuffle your library. Those lands become 4/4 Elemental creatures with trample. They're still lands.", 
    "type": "Planeswalker — Nissa", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 5, 
    "colorIdentity": [
      "U"
    ], 
    "colors": [
      "Blue"
    ], 
    "imageName": "jace, memory adept", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{3}{U}{U}", 
    "name": "Jace, Memory Adept", 
    "printings": [
      "pMEI", 
      "M12", 
      "M13", 
      "M14"
    ], 
    "rulings": [
      {
        "date": "2011-09-22", 
        "text": "If you target yourself with Jace's first ability, you'll draw a card first, then put the top card of your library into your graveyard."
      }, 
      {
        "date": "2011-09-22", 
        "text": "If you activate Jace's first ability, and the player is an illegal target when the ability tries to resolve, it will be countered and none of its effects will happen. You won't draw a card."
      }, 
      {
        "date": "2011-09-22", 
        "text": "If Jace's third ability causes a player to draw more cards than are left in his or her library, that player loses the game as a state-based action. If this ability causes all players to do this, the game is a draw."
      }
    ], 
    "subtypes": [
      "Jace"
    ], 
    "text": "+1: Draw a card. Target player puts the top card of his or her library into his or her graveyard.\n0: Target player puts the top ten cards of his or her library into his or her graveyard.\n−7: Any number of target players each draw twenty cards.", 
    "type": "Planeswalker — Jace", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 5, 
    "colorIdentity": [
      "B"
    ], 
    "colors": [
      "Black"
    ], 
    "imageName": "liliana vess", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Lorwyn-Shadowmoor Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 5, 
    "manaCost": "{3}{B}{B}", 
    "name": "Liliana Vess", 
    "printings": [
      "pMEI", 
      "LRW", 
      "M10", 
      "DDD", 
      "M11", 
      "M15", 
      "DD3_GVL"
    ], 
    "rulings": [
      {
        "date": "2009-10-01", 
        "text": "A \"creature card\" is any card with the type creature, even if it has other types such as artifact, enchantment, or land. Older cards of type summon are also creature cards."
      }
    ], 
    "subtypes": [
      "Liliana"
    ], 
    "text": "+1: Target player discards a card.\n−2: Search your library for a card, then shuffle your library and put that card on top of it.\n−8: Put all creature cards from all graveyards onto the battlefield under your control.", 
    "type": "Planeswalker — Liliana", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "G"
    ], 
    "colors": [
      "Green"
    ], 
    "imageName": "nissa revane", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }, 
      {
        "format": "Zendikar Block", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 2, 
    "manaCost": "{2}{G}{G}", 
    "name": "Nissa Revane", 
    "printings": [
      "pMEI", 
      "ZEN"
    ], 
    "rulings": [
      {
        "date": "2009-10-01", 
        "text": "You may activate Nissa's first ability even if you know you have no cards named Nissa's Chosen in your library. You must still shuffle your library in that situation."
      }, 
      {
        "date": "2009-10-01", 
        "text": "You may activate Nissa's second ability even if you control no Elves."
      }
    ], 
    "subtypes": [
      "Nissa"
    ], 
    "text": "+1: Search your library for a card named Nissa's Chosen and put it onto the battlefield. Then shuffle your library.\n+1: You gain 2 life for each Elf you control.\n−7: Search your library for any number of Elf creature cards and put them onto the battlefield. Then shuffle your library.", 
    "type": "Planeswalker — Nissa", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 5, 
    "colorIdentity": [
      "B", 
      "R"
    ], 
    "colors": [
      "Black", 
      "Red"
    ], 
    "imageName": "sarkhan the mad", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }, 
      {
        "format": "Zendikar Block", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 7, 
    "manaCost": "{3}{B}{R}", 
    "name": "Sarkhan the Mad", 
    "printings": [
      "ROE"
    ], 
    "rulings": [
      {
        "date": "2010-06-15", 
        "text": "Unlike previous planeswalkers, Sarkhan the Mad has no way to raise his loyalty."
      }, 
      {
        "date": "2010-06-15", 
        "text": "Once the first ability starts to resolve and you reveal the top card of your library (and see how much damage Sarkhan the Mad deals to himself), it's too late to respond."
      }, 
      {
        "date": "2010-06-15", 
        "text": "The first ability causes Sarkhan to deal damage directly to himself, resulting in that many loyalty counters being removed from him. The damage would never have been dealt to you, so prevention effects that would prevent damage from being dealt to you won't affect it."
      }, 
      {
        "date": "2010-06-15", 
        "text": "If the targeted creature is an illegal target by the time the second ability resolves, the ability is countered. The player won't get a Dragon token."
      }, 
      {
        "date": "2010-06-15", 
        "text": "If the targeted creature is a legal target by the time the second ability resolves but its controller can't sacrifice it (due to Tajuru Preserver, perhaps), the ability continues to resolve. That player gets a Dragon token."
      }, 
      {
        "date": "2010-06-15", 
        "text": "You choose a single target as you activate the third ability. All your Dragons deal damage to that player."
      }, 
      {
        "date": "2010-06-15", 
        "text": "If you target an opponent with the third ability, you choose separately for each Dragon creature you control whether or not to redirect the damage dealt by that Dragon to a planeswalker that player controls."
      }
    ], 
    "subtypes": [
      "Sarkhan"
    ], 
    "text": "0: Reveal the top card of your library and put it into your hand. Sarkhan the Mad deals damage to himself equal to that card's converted mana cost.\n−2: Target creature's controller sacrifices it, then that player creates a 5/5 red Dragon creature token with flying.\n−4: Each Dragon creature you control deals damage equal to its power to target player.", 
    "type": "Planeswalker — Sarkhan", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 5, 
    "colorIdentity": [
      "B"
    ], 
    "colors": [
      "Black"
    ], 
    "imageName": "ob nixilis reignited", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Battle for Zendikar Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Standard", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 5, 
    "manaCost": "{3}{B}{B}", 
    "name": "Ob Nixilis Reignited", 
    "printings": [
      "pPRE", 
      "BFZ", 
      "DDR"
    ], 
    "rulings": [
      {
        "date": "2015-08-25", 
        "text": "The emblem created by Ob Nixilis Reignited's last ability is both owned and controlled by the target opponent. In a multiplayer game, if you own Ob Nixilis Reignited and use him to give one of your opponents an emblem, the emblem remains even if you leave the game."
      }
    ], 
    "subtypes": [
      "Nixilis"
    ], 
    "text": "+1: You draw a card and you lose 1 life.\n−3: Destroy target creature.\n−8: Target opponent gets an emblem with \"Whenever a player draws a card, you lose 2 life.\"", 
    "type": "Planeswalker — Nixilis", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "R", 
      "G"
    ], 
    "colors": [
      "Red", 
      "Green"
    ], 
    "imageName": "arlinn, embraced by the moon", 
    "layout": "double-faced", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Shadows over Innistrad Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Standard", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "name": "Arlinn, Embraced by the Moon", 
    "names": [
      "Arlinn Kord", 
      "Arlinn, Embraced by the Moon"
    ], 
    "printings": [
      "SOI"
    ], 
    "rulings": [
      {
        "date": "2016-04-08", 
        "text": "The \"planeswalker uniqueness rule\" looks for planeswalkers that share a planeswalker type. If you control Arlinn Kord and Arlinn, Embraced by the Moon at the same time, you'll choose one to put into its owner's graveyard."
      }, 
      {
        "date": "2016-04-08", 
        "text": "Arlinn, Embraced by the Moon is not a Werewolf card; that is, she doesn't have the creature type Werewolf. Spells and abilities that refer to Werewolf cards or Werewolves don't apply to Arlinn."
      }, 
      {
        "date": "2016-04-08", 
        "text": "When the ability that transforms Arlinn Kord into Arlinn, Embraced by the Moon (or vice versa) resolves, the number of loyalty counters on her doesn't change."
      }, 
      {
        "date": "2016-04-08", 
        "text": "You can't activate Arlinn Kord's second ability and, after she transforms, activate a loyalty ability of Arlinn, Embraced by the Moon during that turn (or vice versa)."
      }, 
      {
        "date": "2016-04-08", 
        "text": "The set of creatures affected by the first ability of Arlinn, Embraced by the Moon is determined as the ability resolves. Creatures you begin to control later in the turn won't get +1/+1 or gain trample."
      }, 
      {
        "date": "2016-04-08", 
        "text": "The emblem grants the activated ability to your creatures. Use the power of the creature as the activated ability resolves to determine how much damage is dealt. If the creature isn't on the battlefield at that time, use its power as it last existed on the battlefield. Note that this works differently than the fight keyword action, which requires both creatures to be on the battlefield for any damage to be dealt."
      }
    ], 
    "subtypes": [
      "Arlinn"
    ], 
    "text": "+1: Creatures you control get +1/+1 and gain trample until end of turn.\n−1: Arlinn, Embraced by the Moon deals 3 damage to target creature or player. Transform Arlinn, Embraced by the Moon.\n−6: You get an emblem with \"Creatures you control have haste and ‘{T}: This creature deals damage equal to its power to target creature or player.'\"", 
    "type": "Planeswalker — Arlinn", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 2, 
    "colorIdentity": [
      "R"
    ], 
    "colors": [
      "Red"
    ], 
    "imageName": "tibalt, the fiend-blooded", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Innistrad Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 2, 
    "manaCost": "{R}{R}", 
    "name": "Tibalt, the Fiend-Blooded", 
    "printings": [
      "AVR", 
      "DDK"
    ], 
    "rulings": [
      {
        "date": "2012-05-01", 
        "text": "The number of cards in the target player's hand is determined when Tibalt's second ability resolves."
      }, 
      {
        "date": "2012-05-01", 
        "text": "When Tibalt's third ability resolves, all creatures will become untapped and gain haste, including ones you controlled before the ability resolved."
      }
    ], 
    "subtypes": [
      "Tibalt"
    ], 
    "text": "+1: Draw a card, then discard a card at random.\n−4: Tibalt, the Fiend-Blooded deals damage equal to the number of cards in target player's hand to that player.\n−6: Gain control of all creatures until end of turn. Untap them. They gain haste until end of turn.", 
    "type": "Planeswalker — Tibalt", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 6, 
    "colorIdentity": [
      "G"
    ], 
    "colors": [
      "Green"
    ], 
    "imageName": "nissa, nature's artisan", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Kaladesh Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Standard", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 5, 
    "manaCost": "{4}{G}{G}", 
    "name": "Nissa, Nature's Artisan", 
    "printings": [
      "KLD"
    ], 
    "rulings": [
      {
        "date": "2016-09-20", 
        "text": "The set of creatures affected by Nissa's last ability is determined as the ability resolves. Creatures you begin to control later in the turn and noncreature permanents that become creatures later in the turn won't get +5/+5 or gain trample."
      }
    ], 
    "subtypes": [
      "Nissa"
    ], 
    "text": "+3: You gain 3 life.\n−4: Reveal the top two cards of your library. Put all land cards from among them onto the battlefield and the rest into your hand.\n−12: Creatures you control get +5/+5 and gain trample until end of turn.", 
    "type": "Planeswalker — Nissa", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "R"
    ], 
    "colors": [
      "Red"
    ], 
    "imageName": "chandra, pyromaster", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{2}{R}{R}", 
    "name": "Chandra, Pyromaster", 
    "printings": [
      "pMEI", 
      "M14", 
      "M15"
    ], 
    "rulings": [
      {
        "date": "2014-07-18", 
        "text": "To activate the first ability, you must target a player but you can choose to not target any creatures."
      }, 
      {
        "date": "2014-07-18", 
        "text": "If the first ability resolves but the damage is prevented or redirected, the target creature still won't be able to block that turn."
      }, 
      {
        "date": "2014-07-18", 
        "text": "The card exiled by the second ability is exiled face up. Playing it follows the normal rules for playing that card. You must pay its costs, and you must follow all applicable timing rules. For example, if it's a creature card, you can cast it only during your main phase while the stack is empty."
      }, 
      {
        "date": "2014-07-18", 
        "text": "If you exile a land card using the second ability, you may play that land only if you have any available land plays. Normally, this means you can play the land only if you haven't played a land yet that turn."
      }, 
      {
        "date": "2014-07-18", 
        "text": "In the third ability, \"exiled this way\" means the cards you just exiled because of that ability resolving. Cards exiled with the second ability or with previous activations of the third ability don't count."
      }, 
      {
        "date": "2014-07-18", 
        "text": "While resolving the third ability, you create the copies of the card in exile and cast them from exile. You can cast zero, one, two, or all three copies. The card itself isn't cast. It remains exiled."
      }, 
      {
        "date": "2014-07-18", 
        "text": "While casting the copies created by the third ability, timing restrictions based on the card's type (such as creature or sorcery) are ignored. Other restrictions, such as \"Cast [this spell] only during combat,\" are not."
      }, 
      {
        "date": "2014-07-18", 
        "text": "Because you're casting the copies \"without paying their mana costs,\" you can't pay any alternative costs for the copies. You can pay additional costs, such as kicker costs. If the copies have any mandatory additional costs, you must pay those."
      }, 
      {
        "date": "2014-07-18", 
        "text": "If the copied card has {X} in its mana cost, you must choose 0 as its value when casting the copies."
      }
    ], 
    "subtypes": [
      "Chandra"
    ], 
    "text": "+1: Chandra, Pyromaster deals 1 damage to target player and 1 damage to up to one target creature that player controls. That creature can't block this turn.\n0: Exile the top card of your library. You may play it this turn.\n−7: Exile the top ten cards of your library. Choose an instant or sorcery card exiled this way and copy it three times. You may cast the copies without paying their mana costs.", 
    "type": "Planeswalker — Chandra", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 6, 
    "colorIdentity": [
      "R"
    ], 
    "colors": [
      "Red"
    ], 
    "imageName": "chandra ablaze", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }, 
      {
        "format": "Zendikar Block", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 5, 
    "manaCost": "{4}{R}{R}", 
    "name": "Chandra Ablaze", 
    "printings": [
      "ZEN"
    ], 
    "rulings": [
      {
        "date": "2009-10-01", 
        "text": "If you activate Chandra Ablaze's first ability, you don't discard a card until the ability resolves. You may activate the ability even if your hand is empty. You choose a target as you activate the ability even if you have no red cards in hand at that time."
      }, 
      {
        "date": "2009-10-01", 
        "text": "As the first ability resolves, nothing happens if your hand is empty. But if you have any cards in hand, you must discard one. If you discard a nonred card, Chandra doesn't deal any damage."
      }, 
      {
        "date": "2009-10-01", 
        "text": "If the creature targeted by the first ability is an illegal target by the time it resolves, the entire ability is countered. You won't discard a card."
      }, 
      {
        "date": "2009-10-01", 
        "text": "You may activate Chandra's second ability even if your hand is empty. As it resolves, a player whose hand is empty simply draws three cards."
      }, 
      {
        "date": "2009-10-01", 
        "text": "You cast red instant cards and red sorcery cards from your graveyard as part of the resolution of Chandra Ablaze's third ability. You don't choose which ones to cast until you're actually doing so as the ability resolves. You cast only the ones you want to, and you may cast them in any order. Timing restrictions based on the card's type (if it's a sorcery) are ignored. Other restrictions are not (such as \"Cast [this card] only during combat\"). Each card you cast this way is put on the stack, then the ability finishes resolving. Those spells will then resolve as normal, one at a time, in the opposite order that they were put on the stack. They'll go back to the graveyard as they resolve."
      }, 
      {
        "date": "2009-10-01", 
        "text": "If you cast a card \"without paying its mana cost,\" you can't pay any alternative costs. You can pay additional costs, such as kicker costs."
      }
    ], 
    "subtypes": [
      "Chandra"
    ], 
    "text": "+1: Discard a card. If a red card is discarded this way, Chandra Ablaze deals 4 damage to target creature or player.\n−2: Each player discards his or her hand, then draws three cards.\n−7: Cast any number of red instant and/or sorcery cards from your graveyard without paying their mana costs.", 
    "type": "Planeswalker — Chandra", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 6, 
    "colorIdentity": [
      "W", 
      "B"
    ], 
    "colors": [
      "White", 
      "Black"
    ], 
    "imageName": "sorin, grim nemesis", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Shadows over Innistrad Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Standard", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 6, 
    "manaCost": "{4}{W}{B}", 
    "name": "Sorin, Grim Nemesis", 
    "printings": [
      "SOI"
    ], 
    "rulings": [
      {
        "date": "2016-04-08", 
        "text": "If a card in your library has {X} in its mana cost, X is considered to be 0."
      }, 
      {
        "date": "2016-04-08", 
        "text": "In a Two-Headed Giant game, the highest life total among all players is the highest life total among all teams."
      }
    ], 
    "subtypes": [
      "Sorin"
    ], 
    "text": "+1: Reveal the top card of your library and put that card into your hand. Each opponent loses life equal to its converted mana cost.\n−X: Sorin, Grim Nemesis deals X damage to target creature or planeswalker and you gain X life.\n−9: Create a number of 1/1 black Vampire Knight creature tokens with lifelink equal to the highest life total among all players.", 
    "type": "Planeswalker — Sorin", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 3, 
    "colorIdentity": [
      "U", 
      "R"
    ], 
    "colors": [
      "Blue", 
      "Red"
    ], 
    "imageName": "dack fayden", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{1}{U}{R}", 
    "name": "Dack Fayden", 
    "printings": [
      "CNS", 
      "VMA", 
      "EMA"
    ], 
    "rulings": [
      {
        "date": "2016-06-08", 
        "text": "The targeted player draws two cards and discards two cards all while Dack's first ability is resolving. Nothing can happen between the two, and no player may choose to take actions."
      }, 
      {
        "date": "2016-06-08", 
        "text": "The ability of Dack's emblem will resolve before the spell that caused it to trigger."
      }, 
      {
        "date": "2016-06-08", 
        "text": "The effect of Dack's second ability and the effect of the emblem's ability last indefinitely. You won't lose control of the permanents if Dack leaves the battlefield."
      }, 
      {
        "date": "2016-06-08", 
        "text": "If you gain control of a permanent, and you leave the game, the control-changing effect will end. Unless there's another control-changing effect affecting that permanent, it will return to its owner's control."
      }, 
      {
        "date": "2016-06-08", 
        "text": "If you gain control of a permanent another player owns, and that player leaves the game, the permanent will also leave the game."
      }
    ], 
    "subtypes": [
      "Dack"
    ], 
    "text": "+1: Target player draws two cards, then discards two cards.\n−2: Gain control of target artifact.\n−6: You get an emblem with \"Whenever you cast a spell that targets one or more permanents, gain control of those permanents.\"", 
    "type": "Planeswalker — Dack", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 6, 
    "colorIdentity": [
      "U", 
      "B"
    ], 
    "colors": [
      "Blue", 
      "Black"
    ], 
    "imageName": "tezzeret, master of metal", 
    "layout": "normal", 
    "loyalty": 5, 
    "manaCost": "{4}{U}{B}", 
    "name": "Tezzeret, Master of Metal", 
    "printings": [
      "AER"
    ], 
    "rulings": [
      {
        "date": "2017-02-09", 
        "text": "If you don't have an artifact card in your library while resolving Tezzeret's first ability, you'll reveal your library and then randomize it."
      }, 
      {
        "date": "2017-02-09", 
        "text": "The effect of Tezzeret's third ability lasts indefinitely."
      }
    ], 
    "subtypes": [
      "Tezzeret"
    ], 
    "text": "+1: Reveal cards from the top of your library until you reveal an artifact card. Put that card into your hand and the rest on the bottom of your library in a random order.\n−3: Target opponent loses life equal to the number of artifacts you control.\n−8: Gain control of all artifacts and creatures target opponent controls.", 
    "type": "Planeswalker — Tezzeret", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 3, 
    "colorIdentity": [
      "U", 
      "B"
    ], 
    "colors": [
      "Blue", 
      "Black"
    ], 
    "imageName": "ashiok, nightmare weaver", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Theros Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{1}{U}{B}", 
    "name": "Ashiok, Nightmare Weaver", 
    "printings": [
      "THS"
    ], 
    "rulings": [
      {
        "date": "2013-09-15", 
        "text": "Ashiok's second ability refers to any creature card exiled because of Ashiok's first or third ability."
      }, 
      {
        "date": "2013-09-15", 
        "text": "Ashiok's second ability doesn't target any creature card. You choose which creature card to return when that ability resolves, but you must choose one with converted mana cost equal to the value you chose for X when activating the ability."
      }, 
      {
        "date": "2013-09-15", 
        "text": "If Ashiok leaves the battlefield, and later another Ashiok enters the battlefield, it is a new object (even if the two were represented by the same card). Creature cards exiled by the original Ashiok can't be put onto the battlefield by the second ability of the new Ashiok."
      }, 
      {
        "date": "2013-09-15", 
        "text": "If you put a creature card with bestow onto the battlefield, it will be a creature on the battlefield, not an Aura."
      }, 
      {
        "date": "2013-09-15", 
        "text": "If you put a creature card with {X} in its mana cost onto the battlefield, the value of that X is 0."
      }
    ], 
    "subtypes": [
      "Ashiok"
    ], 
    "text": "+2: Exile the top three cards of target opponent's library.\n−X: Put a creature card with converted mana cost X exiled with Ashiok, Nightmare Weaver onto the battlefield under your control. That creature is a Nightmare in addition to its other types.\n−10: Exile all cards from all opponents' hands and graveyards.", 
    "type": "Planeswalker — Ashiok", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 5, 
    "colorIdentity": [
      "B", 
      "G"
    ], 
    "colors": [
      "Black", 
      "Green"
    ], 
    "imageName": "vraska the unseen", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Return to Ravnica Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 5, 
    "manaCost": "{3}{B}{G}", 
    "name": "Vraska the Unseen", 
    "printings": [
      "RTR", 
      "DDM"
    ], 
    "rulings": [
      {
        "date": "2012-10-01", 
        "text": "If an effect creates a copy of one of the Assassin creature tokens, the copy will also have the triggered ability."
      }, 
      {
        "date": "2012-10-01", 
        "text": "Each Assassin token's triggered ability will trigger whenever it deals combat damage to any player, including you."
      }
    ], 
    "subtypes": [
      "Vraska"
    ], 
    "text": "+1: Until your next turn, whenever a creature deals combat damage to Vraska the Unseen, destroy that creature.\n−3: Destroy target nonland permanent.\n−7: Create three 1/1 black Assassin creature tokens with \"Whenever this creature deals combat damage to a player, that player loses the game.\"", 
    "type": "Planeswalker — Vraska", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 5, 
    "colorIdentity": [
      "U", 
      "R", 
      "G"
    ], 
    "colors": [
      "Blue", 
      "Red", 
      "Green"
    ], 
    "imageName": "sarkhan unbroken", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Khans of Tarkir Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{2}{G}{U}{R}", 
    "name": "Sarkhan Unbroken", 
    "printings": [
      "DTK"
    ], 
    "subtypes": [
      "Sarkhan"
    ], 
    "text": "+1: Draw a card, then add one mana of any color to your mana pool.\n−2: Create a 4/4 red Dragon creature token with flying.\n−8: Search your library for any number of Dragon creature cards and put them onto the battlefield. Then shuffle your library.", 
    "type": "Planeswalker — Sarkhan", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "W"
    ], 
    "colors": [
      "White"
    ], 
    "imageName": "ajani steadfast", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{3}{W}", 
    "name": "Ajani Steadfast", 
    "printings": [
      "pMEI", 
      "M15"
    ], 
    "rulings": [
      {
        "date": "2014-07-18", 
        "text": "You may activate the first ability with no targets. If you do, you simply put a loyalty counter on Ajani to pay the cost of the ability."
      }, 
      {
        "date": "2014-07-18", 
        "text": "If a permanent you control is both a creature and a planeswalker, Ajani's second ability will put both a +1/+1 counter and a loyalty counter on it."
      }, 
      {
        "date": "2014-07-18", 
        "text": "The emblem's ability doesn't consider who controls the source dealing damage to you or a planeswalker you control."
      }, 
      {
        "date": "2014-07-18", 
        "text": "Each attacking creature is a separate source of damage. For example, if two 3/3 creatures attack you and are unblocked, the emblem will prevent 2 damage from each creature. You'll be dealt a total of 2 damage."
      }, 
      {
        "date": "2014-07-18", 
        "text": "If multiple effects modify how damage is dealt, the player being dealt damage or the controller of the permanent being dealt damage chooses the order to apply the effects. For example, Dictate of the Twin Gods says, \"If a source would deal damage to a permanent or player, it deals double that damage to that permanent or player instead.\" Suppose you would be dealt 3 damage while Dictate of the Twin Gods is on the battlefield and you control Ajani's emblem. You can either (a) prevent all but 1 damage first and then let Dictate of the Twin Gods's effect double that, for a result of being dealt 2 damage, or (b) double the damage to 6 and then prevent all but 1 of that damage."
      }
    ], 
    "subtypes": [
      "Ajani"
    ], 
    "text": "+1: Until end of turn, up to one target creature gets +1/+1 and gains first strike, vigilance, and lifelink.\n−2: Put a +1/+1 counter on each creature you control and a loyalty counter on each other planeswalker you control.\n−7: You get an emblem with \"If a source would deal damage to you or a planeswalker you control, prevent all but 1 of that damage.\"", 
    "type": "Planeswalker — Ajani", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "U", 
      "B"
    ], 
    "colors": [
      "Blue", 
      "Black"
    ], 
    "imageName": "tezzeret the schemer", 
    "layout": "normal", 
    "loyalty": 5, 
    "manaCost": "{2}{U}{B}", 
    "name": "Tezzeret the Schemer", 
    "printings": [
      "AER"
    ], 
    "rulings": [
      {
        "date": "2017-02-09", 
        "text": "The value of X for Tezzeret's second ability is determined only as the ability resolves. It won't change later in the turn if the number of artifacts you control changes."
      }, 
      {
        "date": "2017-02-09", 
        "text": "The effect of the emblem's triggered ability lasts indefinitely."
      }, 
      {
        "date": "2017-02-09", 
        "text": "An artifact that becomes a creature due to the emblem's ability can't attack unless you've controlled it continuously since your turn began. It doesn't matter whether or not it was a creature at that time."
      }, 
      {
        "date": "2017-02-09", 
        "text": "An artifact creature targeted by the emblem's ability becomes 5/5 instead of its normal power and toughness."
      }, 
      {
        "date": "2017-02-09", 
        "text": "A Vehicle targeted by the emblem's ability becomes a 5/5 creature. Crewing it won't change its power and toughness."
      }, 
      {
        "date": "2017-02-09", 
        "text": "If an Equipment becomes a creature, it becomes unattached and it can't be attached to a creature."
      }
    ], 
    "subtypes": [
      "Tezzeret"
    ], 
    "text": "+1: Create a colorless artifact token named Etherium Cell with \"{T}, Sacrifice this artifact: Add one mana of any color to your mana pool.\"\n−2: Target creature gets +X/-X until end of turn, where X is the number of artifacts you control.\n−7: You get an emblem with \"At the beginning of combat on your turn, target artifact you control becomes an artifact creature with base power and toughness 5/5.\"", 
    "type": "Planeswalker — Tezzeret", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "W"
    ], 
    "colors": [
      "White"
    ], 
    "imageName": "elspeth, knight-errant", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Shards of Alara Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{2}{W}{W}", 
    "name": "Elspeth, Knight-Errant", 
    "printings": [
      "ALA", 
      "DDF", 
      "MMA", 
      "MD1"
    ], 
    "rulings": [
      {
        "date": "2011-01-01", 
        "text": "Emblems behave similarly to enchantments: They have an ability that, in a general sense, continually affects the game. The primary difference between them is that emblems aren't permanents and don't exist on the battlefield. Nothing in the game can remove an emblem, simply because no other spell or ability references them. Once you get an emblem, you keep it for the rest of the game. Emblems have no color, name, card type, or other characteristics beyond the listed ability"
      }, 
      {
        "date": "2013-07-01", 
        "text": "Lethal damage and effects that say \"destroy\" won't cause a permanent with indestructible to be put into the graveyard. However, a permanent with indestructible can be put into the graveyard for a number of reasons. The most likely reasons are if it's sacrificed, if it's a creature whose toughness is 0 or less, or if it's an Aura that's either unattached or attached to something illegal."
      }
    ], 
    "subtypes": [
      "Elspeth"
    ], 
    "text": "+1: Create a 1/1 white Soldier creature token.\n+1: Target creature gets +3/+3 and gains flying until end of turn.\n−8: You get an emblem with \"Artifacts, creatures, enchantments, and lands you control have indestructible.\"", 
    "type": "Planeswalker — Elspeth", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 5, 
    "colorIdentity": [
      "B"
    ], 
    "colors": [
      "Black"
    ], 
    "imageName": "ob nixilis of the black oath", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{3}{B}{B}", 
    "name": "Ob Nixilis of the Black Oath", 
    "printings": [
      "C14"
    ], 
    "subtypes": [
      "Nixilis"
    ], 
    "text": "+2: Each opponent loses 1 life. You gain life equal to the life lost this way.\n−2: Create a 5/5 black Demon creature token with flying. You lose 2 life.\n−8: You get an emblem with \"{1}{B}, Sacrifice a creature: You gain X life and draw X cards, where X is the sacrificed creature's power.\"\nOb Nixilis of the Black Oath can be your commander.", 
    "type": "Planeswalker — Nixilis", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "U", 
      "G"
    ], 
    "colors": [
      "Blue", 
      "Green"
    ], 
    "imageName": "kiora, master of the depths", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Battle for Zendikar Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Standard", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{2}{G}{U}", 
    "name": "Kiora, Master of the Depths", 
    "printings": [
      "pPRE", 
      "BFZ"
    ], 
    "rulings": [
      {
        "date": "2015-08-25", 
        "text": "You can activate Kiora's first ability with no targets just to put a loyalty counter on her."
      }, 
      {
        "date": "2015-08-25", 
        "text": "With Kiora's second ability, you could put no cards, a creature card, a land card, or a creature card and a land card into your hand."
      }, 
      {
        "date": "2015-08-25", 
        "text": "You will have the emblem by the time the Octopus creature tokens enter the battlefield—they'll be looking to fight!"
      }
    ], 
    "subtypes": [
      "Kiora"
    ], 
    "text": "+1: Untap up to one target creature and up to one target land.\n−2: Reveal the top four cards of your library. You may put a creature card and/or a land card from among them into your hand. Put the rest into your graveyard.\n−8: You get an emblem with \"Whenever a creature enters the battlefield under your control, you may have it fight target creature.\" Then create three 8/8 blue Octopus creature tokens.", 
    "type": "Planeswalker — Kiora", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 5, 
    "colorIdentity": [
      "W"
    ], 
    "colors": [
      "White"
    ], 
    "imageName": "nahiri, the lithomancer", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{3}{W}{W}", 
    "name": "Nahiri, the Lithomancer", 
    "printings": [
      "C14"
    ], 
    "subtypes": [
      "Nahiri"
    ], 
    "text": "+2: Create a 1/1 white Kor Soldier creature token. You may attach an Equipment you control to it.\n−2: You may put an Equipment card from your hand or graveyard onto the battlefield.\n−10: Create a colorless Equipment artifact token named Stoneforged Blade. It has indestructible, \"Equipped creature gets +5/+5 and has double strike,\" and equip {0}.\nNahiri, the Lithomancer can be your commander.", 
    "type": "Planeswalker — Nahiri", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "W", 
      "U"
    ], 
    "colors": [
      "White", 
      "Blue"
    ], 
    "imageName": "dovin baan", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Kaladesh Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Standard", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{2}{W}{U}", 
    "name": "Dovin Baan", 
    "printings": [
      "KLD"
    ], 
    "rulings": [
      {
        "date": "2016-09-20", 
        "text": "Dovin Baan's first ability can target any creature, not just one with an activated ability. It can also be activated targeting no creature at all."
      }, 
      {
        "date": "2016-09-20", 
        "text": "Activated abilities contain a colon. They're generally written \"[Cost]: [Effect].\" Some keywords are activated abilities and will have colons in their reminder text."
      }, 
      {
        "date": "2016-09-20", 
        "text": "An opponent affected by Dovin Baan's emblem chooses which two of his or her permanents to untap, not you."
      }
    ], 
    "subtypes": [
      "Dovin"
    ], 
    "text": "+1: Until your next turn, up to one target creature gets -3/-0 and its activated abilities can't be activated.\n−1: You gain 2 life and draw a card.\n−7: You get an emblem with \"Your opponents can't untap more than two permanents during their untap steps.\"", 
    "type": "Planeswalker — Dovin", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "U", 
      "R"
    ], 
    "colors": [
      "Blue", 
      "Red"
    ], 
    "imageName": "ral zarek", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Return to Ravnica Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{2}{U}{R}", 
    "name": "Ral Zarek", 
    "printings": [
      "DGM"
    ], 
    "subtypes": [
      "Ral"
    ], 
    "text": "+1: Tap target permanent, then untap another target permanent.\n−2: Ral Zarek deals 3 damage to target creature or player.\n−7: Flip five coins. Take an extra turn after this one for each coin that comes up heads.", 
    "type": "Planeswalker — Ral", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 3, 
    "colorIdentity": [
      "G"
    ], 
    "colors": [
      "Green"
    ], 
    "imageName": "nissa, sage animist", 
    "layout": "double-faced", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "name": "Nissa, Sage Animist", 
    "names": [
      "Nissa, Vastwood Seer", 
      "Nissa, Sage Animist"
    ], 
    "printings": [
      "ORI"
    ], 
    "rulings": [
      {
        "date": "2015-06-22", 
        "text": "You can activate Nissa, Sage Animist's second ability even if you already control an Ashaya, the Awoken World. Just after the second token is created, you'll choose one to remain on the battlefield. The other will be put into your graveyard and subsequently cease to exist."
      }, 
      {
        "date": "2015-06-22", 
        "text": "If a land becomes a creature but hasn't continuously been under its controller's control since that player's most recent turn began, it won't be able to attack and its abilities with {T} in the cost (including mana abilities) won't be able to be activated. In other words, look at how long the permanent itself has been under your control, not how long it's been a creature."
      }
    ], 
    "subtypes": [
      "Nissa"
    ], 
    "text": "+1: Reveal the top card of your library. If it's a land card, put it onto the battlefield. Otherwise, put it into your hand.\n−2: Create a legendary 4/4 green Elemental creature token named Ashaya, the Awoken World.\n−7: Untap up to six target lands. They become 6/6 Elemental creatures. They're still lands.", 
    "type": "Planeswalker — Nissa", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "U"
    ], 
    "colors": [
      "Blue"
    ], 
    "imageName": "jace, the mind sculptor", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Banned"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }, 
      {
        "format": "Zendikar Block", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{2}{U}{U}", 
    "name": "Jace, the Mind Sculptor", 
    "printings": [
      "WWK", 
      "V13", 
      "VMA", 
      "EMA"
    ], 
    "rulings": [
      {
        "date": "2016-06-08", 
        "text": "You draw three cards and put two cards back all while Jace's second ability is resolving. Nothing can happen between the two, and no player may choose to take actions."
      }, 
      {
        "date": "2016-06-08", 
        "text": "If the targeted player for Jace's last ability has no cards in hand, that player shuffles nothing into his or her library, and that player's library will remain empty. That player won't lose the game until he or she tries to draw from the empty library."
      }
    ], 
    "subtypes": [
      "Jace"
    ], 
    "text": "+2: Look at the top card of target player's library. You may put that card on the bottom of that player's library.\n0: Draw three cards, then put two cards from your hand on top of your library in any order.\n−1: Return target creature to its owner's hand.\n−12: Exile all cards from target player's library, then that player shuffles his or her hand into his or her library.", 
    "type": "Planeswalker — Jace", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "R", 
      "G"
    ], 
    "colors": [
      "Red", 
      "Green"
    ], 
    "imageName": "arlinn kord", 
    "layout": "double-faced", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Shadows over Innistrad Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Standard", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{2}{R}{G}", 
    "name": "Arlinn Kord", 
    "names": [
      "Arlinn Kord", 
      "Arlinn, Embraced by the Moon"
    ], 
    "printings": [
      "SOI"
    ], 
    "rulings": [
      {
        "date": "2016-04-08", 
        "text": "The \"planeswalker uniqueness rule\" looks for planeswalkers that share a planeswalker type. If you control Arlinn Kord and Arlinn, Embraced by the Moon at the same time, you'll choose one to put into its owner's graveyard."
      }, 
      {
        "date": "2016-04-08", 
        "text": "Arlinn Kord is not a Werewolf card; that is, she doesn't have the creature type Werewolf. Spells and abilities that refer to Werewolf cards or Werewolves don't apply to Arlinn."
      }, 
      {
        "date": "2016-04-08", 
        "text": "You can activate the first ability of Arlinn Kord without any targets just to add a loyalty counter to her."
      }, 
      {
        "date": "2016-04-08", 
        "text": "When the ability that transforms Arlinn Kord into Arlinn, Embraced by the Moon (or vice versa) resolves, the number of loyalty counters on her doesn't change."
      }, 
      {
        "date": "2016-04-08", 
        "text": "You can't activate Arlinn Kord's second ability and, after she transforms, activate a loyalty ability of Arlinn, Embraced by the Moon during that turn (or vice versa)."
      }, 
      {
        "date": "2016-07-13", 
        "text": "For more information on double-faced cards, see the Shadows over Innistrad mechanics article (http://magic.wizards.com/en/articles/archive/feature/shadows-over-innistrad-mechanics)."
      }
    ], 
    "subtypes": [
      "Arlinn"
    ], 
    "text": "+1: Until end of turn, up to one target creature gets +2/+2 and gains vigilance and haste.\n0: Create a 2/2 green Wolf creature token. Transform Arlinn Kord.", 
    "type": "Planeswalker — Arlinn", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 5, 
    "colorIdentity": [
      "G"
    ], 
    "colors": [
      "Green"
    ], 
    "imageName": "garruk, primal hunter", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{2}{G}{G}{G}", 
    "name": "Garruk, Primal Hunter", 
    "printings": [
      "M12", 
      "M13"
    ], 
    "rulings": [
      {
        "date": "2011-09-22", 
        "text": "For Garruk's second ability, the greatest power among creatures you control is determined when that ability begins resolving."
      }, 
      {
        "date": "2011-09-22", 
        "text": "If the greatest power among creatures you control is 0 or less, you'll draw no cards. You won't discard any cards this way."
      }, 
      {
        "date": "2011-09-22", 
        "text": "For Garruk's third ability, the number of Wurm tokens you put onto the battlefield is determined when that ability begins resolving."
      }
    ], 
    "subtypes": [
      "Garruk"
    ], 
    "text": "+1: Create a 3/3 green Beast creature token.\n−3: Draw cards equal to the greatest power among creatures you control.\n−6: Create a 6/6 green Wurm creature token for each land you control.", 
    "type": "Planeswalker — Garruk", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "W", 
      "R"
    ], 
    "colors": [
      "White", 
      "Red"
    ], 
    "imageName": "nahiri, the harbinger", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Shadows over Innistrad Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Standard", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{2}{R}{W}", 
    "name": "Nahiri, the Harbinger", 
    "printings": [
      "SOI"
    ], 
    "rulings": [
      {
        "date": "2016-04-08", 
        "text": "You can activate Nahiri's first ability with no intention of discarding a card just to add loyalty to Nahiri."
      }, 
      {
        "date": "2016-04-08", 
        "text": "If you find a noncreature artifact with Nahiri's third ability, it will still gain haste, even though it won't be meaningful unless that artifact becomes a creature."
      }, 
      {
        "date": "2016-04-08", 
        "text": "If the artifact or creature put onto the battlefield with Nahiri's third ability leaves the battlefield before the next end step, it won't be returned to your hand from its new zone."
      }
    ], 
    "subtypes": [
      "Nahiri"
    ], 
    "text": "+2: You may discard a card. If you do, draw a card.\n−2: Exile target enchantment, tapped artifact, or tapped creature.\n−8: Search your library for an artifact or creature card, put it onto the battlefield, then shuffle your library. It gains haste. Return it to your hand at the beginning of the next end step.", 
    "type": "Planeswalker — Nahiri", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "W", 
      "U"
    ], 
    "colors": [
      "White", 
      "Blue"
    ], 
    "imageName": "narset transcendent", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Khans of Tarkir Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 6, 
    "manaCost": "{2}{W}{U}", 
    "name": "Narset Transcendent", 
    "printings": [
      "DTK"
    ], 
    "rulings": [
      {
        "date": "2015-02-25", 
        "text": "When resolving Narset's first ability, if the top card of your library is a creature or a land card, or if you don't wish to put it into your hand, it isn't revealed."
      }, 
      {
        "date": "2015-02-25", 
        "text": "If a spell that exiles itself as part of its own resolution, such as Volcanic Vision, gains rebound, the ability that lets you cast the spell again won't be created. The spell will simply be exiled."
      }
    ], 
    "subtypes": [
      "Narset"
    ], 
    "text": "+1: Look at the top card of your library. If it's a noncreature, nonland card, you may reveal it and put it into your hand.\n−2: When you cast your next instant or sorcery spell from your hand this turn, it gains rebound.\n−9: You get an emblem with \"Your opponents can't cast noncreature spells.\"", 
    "type": "Planeswalker — Narset", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "R"
    ], 
    "colors": [
      "Red"
    ], 
    "imageName": "chandra, torch of defiance", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Kaladesh Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Standard", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{2}{R}{R}", 
    "name": "Chandra, Torch of Defiance", 
    "printings": [
      "KLD"
    ], 
    "rulings": [
      {
        "date": "2016-09-20", 
        "text": "An effect that instructs you to \"cast\" a card doesn't allow you to play lands. If the card exiled with Chandra's first ability is a land card, you can't play it and Chandra deals 2 damage to each opponent."
      }, 
      {
        "date": "2016-09-20", 
        "text": "If you cast the exiled card, you do so as part of the resolution of Chandra's ability. You can't wait to cast it later in the turn. Timing permissions based on the card's type are ignored, but other restrictions (such as \"Cast [this card] only during combat\") are not."
      }, 
      {
        "date": "2016-09-20", 
        "text": "You pay the costs for the exiled card if you cast it. You may pay alternative costs such as emerge rather than the card's mana cost."
      }, 
      {
        "date": "2016-09-20", 
        "text": "Loyalty abilities can't be mana abilities. Chandra's second ability uses the stack and can be countered or otherwise responded to. Like all loyalty abilities, it can be activated only once per turn, during your main phase, when the stack is empty, and only if no other loyalty abilities of the planeswalker have been activated this turn."
      }, 
      {
        "date": "2016-09-20", 
        "text": "The emblem created by Chandra's last ability is colorless. The damage it deals is from a colorless source."
      }, 
      {
        "date": "2016-09-20", 
        "text": "Chandra's emblem's ability resolves before the spell that caused it to trigger."
      }, 
      {
        "date": "2016-09-20", 
        "text": "In a Two-Headed Giant game, Chandra's first ability causes 4 damage total to be dealt to the opposing team."
      }
    ], 
    "subtypes": [
      "Chandra"
    ], 
    "text": "+1: Exile the top card of your library. You may cast that card. If you don't, Chandra, Torch of Defiance deals 2 damage to each opponent.\n+1: Add {R}{R} to your mana pool.\n−3: Chandra, Torch of Defiance deals 4 damage to target creature.\n−7: You get an emblem with \"Whenever you cast a spell, this emblem deals 5 damage to target creature or player.\"", 
    "type": "Planeswalker — Chandra", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "B"
    ], 
    "colors": [
      "Black"
    ], 
    "imageName": "liliana of the dark realms", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{2}{B}{B}", 
    "name": "Liliana of the Dark Realms", 
    "printings": [
      "pMEI", 
      "M13", 
      "M14"
    ], 
    "rulings": [
      {
        "date": "2012-07-01", 
        "text": "You can activate Liliana's first ability even if your library contains no Swamp cards (or you don't want to find one). You'll still search your library and shuffle it."
      }, 
      {
        "date": "2012-07-01", 
        "text": "When you activate Liliana's second ability, you choose only the target creature. You choose whether that creature gets +X/+X or -X/-X when the ability resolves. The value of X is determined by the number of Swamps you control when the ability resolves."
      }, 
      {
        "date": "2012-07-01", 
        "text": "Liliana's emblem doesn't remove any other abilities of Swamps you control."
      }, 
      {
        "date": "2013-07-01", 
        "text": "Each of Liliana's abilities refers to lands (or land cards) with the subtype Swamp, not just ones named Swamp."
      }
    ], 
    "subtypes": [
      "Liliana"
    ], 
    "text": "+1: Search your library for a Swamp card, reveal it, and put it into your hand. Then shuffle your library.\n−3: Target creature gets +X/+X or -X/-X until end of turn, where X is the number of Swamps you control.\n−6: You get an emblem with \"Swamps you control have ‘{T}: Add {B}{B}{B}{B} to your mana pool.'\"", 
    "type": "Planeswalker — Liliana", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "U"
    ], 
    "colors": [
      "Blue"
    ], 
    "imageName": "jace, the living guildpact", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 5, 
    "manaCost": "{2}{U}{U}", 
    "name": "Jace, the Living Guildpact", 
    "printings": [
      "pMEI", 
      "M15"
    ], 
    "rulings": [
      {
        "date": "2014-07-18", 
        "text": "When the first ability resolves, the card you don't put into your graveyard stays on top of your library."
      }, 
      {
        "date": "2014-07-18", 
        "text": "If a player has no cards in his or her hand and no cards in his or her graveyard when the third ability resolves, that player won't shuffle his or her library."
      }
    ], 
    "subtypes": [
      "Jace"
    ], 
    "text": "+1: Look at the top two cards of your library. Put one of them into your graveyard.\n−3: Return another target nonland permanent to its owner's hand.\n−8: Each player shuffles his or her hand and graveyard into his or her library. You draw seven cards.", 
    "type": "Planeswalker — Jace", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 6, 
    "colorIdentity": [
      "W", 
      "G"
    ], 
    "colors": [
      "White", 
      "Green"
    ], 
    "imageName": "ajani, valiant protector", 
    "layout": "normal", 
    "loyalty": 4, 
    "manaCost": "{4}{G}{W}", 
    "name": "Ajani, Valiant Protector", 
    "printings": [
      "AER"
    ], 
    "rulings": [
      {
        "date": "2017-02-09", 
        "text": "If you don't have a creature card in your library while resolving Ajani's second ability, you'll reveal your library and then randomize it."
      }, 
      {
        "date": "2017-02-09", 
        "text": "The value of X for Ajani's third ability is determined only as it resolves. The number of +1/+1 counters on the creature won't change later if your life total changes."
      }
    ], 
    "subtypes": [
      "Ajani"
    ], 
    "text": "+2: Put two +1/+1 counters on up to one target creature.\n+1: Reveal cards from the top of your library until you reveal a creature card. Put that card into your hand and the rest on the bottom of your library in a random order.\n−11: Put X +1/+1 counters on target creature, where X is your life total. That creature gains trample until end of turn.", 
    "type": "Planeswalker — Ajani", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 8, 
    "imageName": "ugin, the spirit dragon", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Khans of Tarkir Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 7, 
    "manaCost": "{8}", 
    "name": "Ugin, the Spirit Dragon", 
    "printings": [
      "FRF_UGIN", 
      "FRF"
    ], 
    "rulings": [
      {
        "date": "2014-11-24", 
        "text": "If you choose to put permanent cards with morph onto the battlefield with the third ability, you must put them onto the battlefield face up."
      }, 
      {
        "date": "2014-11-24", 
        "text": "Ugin, the Spirit Dragon is not a Dragon card; that is, he doesn't have the creature type Dragon. Spells and abilities that refer to Dragon cards or Dragons don't apply to Ugin."
      }
    ], 
    "subtypes": [
      "Ugin"
    ], 
    "text": "+2: Ugin, the Spirit Dragon deals 3 damage to target creature or player.\n−X: Exile each permanent with converted mana cost X or less that's one or more colors.\n−10: You gain 7 life, draw seven cards, then put up to seven permanent cards from your hand onto the battlefield.", 
    "type": "Planeswalker — Ugin", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "B", 
      "G"
    ], 
    "colors": [
      "Black", 
      "Green"
    ], 
    "imageName": "garruk, the veil-cursed", 
    "layout": "double-faced", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Innistrad Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "name": "Garruk, the Veil-Cursed", 
    "names": [
      "Garruk Relentless", 
      "Garruk, the Veil-Cursed"
    ], 
    "printings": [
      "ISD"
    ], 
    "rulings": [
      {
        "date": "2011-09-22", 
        "text": "The second ability of Garruk, the Veil-Cursed doesn't target a creature. However, when that ability resolves, you must sacrifice a creature if you control one."
      }, 
      {
        "date": "2011-09-22", 
        "text": "The number of creature cards in your graveyard is counted when the third ability of Garruk, the Veil-Cursed resolves. Once the ability resolves, the bonus doesn't change if that number changes later in the turn."
      }, 
      {
        "date": "2011-09-22", 
        "text": "Only creatures you control when the third ability of Garruk, the Veil-Cursed resolves will receive the bonus. Creatures that enter the battlefield or that you gain control of later in the turn won't be affected."
      }
    ], 
    "subtypes": [
      "Garruk"
    ], 
    "text": "+1: Create a 1/1 black Wolf creature token with deathtouch.\n−1: Sacrifice a creature. If you do, search your library for a creature card, reveal it, put it into your hand, then shuffle your library.\n−3: Creatures you control gain trample and get +X/+X until end of turn, where X is the number of creature cards in your graveyard.", 
    "type": "Planeswalker — Garruk", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "W"
    ], 
    "colors": [
      "White"
    ], 
    "imageName": "gideon, champion of justice", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Return to Ravnica Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{2}{W}{W}", 
    "name": "Gideon, Champion of Justice", 
    "printings": [
      "GTC"
    ], 
    "rulings": [
      {
        "date": "2013-01-24", 
        "text": "You put a loyalty counter on Gideon, Champion of Justice as part of the cost of activating the first ability. When that ability resolves, you count the number of creatures controlled by the target opponent and put that many additional loyalty counters on Gideon."
      }, 
      {
        "date": "2013-01-24", 
        "text": "If the first ability is countered (perhaps because the target opponent is an illegal target when the ability tries to resolve), you won't put any additional loyalty counters on Gideon, although the loyalty counter you put on him to activate the ability will remain."
      }, 
      {
        "date": "2013-01-24", 
        "text": "If Gideon, Champion of Justice becomes a creature due to his second ability, that doesn't count as having a creature enter the battlefield. Gideon was already on the battlefield; he only changed his types. Abilities that trigger whenever a creature enters the battlefield won't trigger."
      }, 
      {
        "date": "2013-01-24", 
        "text": "Gideon, Champion of Justice's power and toughness are set to the number of loyalty counters on him when his second ability resolves. They won't change later in the turn if the number of loyalty counters on him changes."
      }, 
      {
        "date": "2013-01-24", 
        "text": "If Gideon, Champion of Justice becomes a creature the same turn he enters the battlefield, you can't attack with him or use any of his {T} abilities (if he gains any)."
      }, 
      {
        "date": "2013-01-24", 
        "text": "Gideon, Champion of Justice's second ability causes him to become a creature with the creature types Human and Soldier. He remains a planeswalker with the planeswalker type Gideon. (He also retains any other card types or subtypes he may have had.) Each subtype is correlated to the proper card type: Gideon is just a planeswalker type (not a creature type), and Human and Soldier are just creature types (not planeswalker types)."
      }, 
      {
        "date": "2013-01-24", 
        "text": "Say you activate Gideon, Champion of Justice's second ability, and then an opponent gains control of him before combat. You may have any of your creatures attack Gideon, Champion of Justice (since he's still a planeswalker). Then Gideon, Champion of Justice may block (since he's a creature). He may block any eligible attacking creature, including one that's attacking him! During combat, he behaves as an attacked planeswalker and/or a blocking creature, as appropriate. For example, he deals combat damage to any creatures he's blocking, but he doesn't deal combat damage to any unblocked creatures that are attacking him."
      }, 
      {
        "date": "2013-07-01", 
        "text": "If damage that can't be prevented is dealt to Gideon, Champion of Justice after his second ability has resolved, that damage will have all applicable results: specifically, the damage is marked on Gideon (since he's a creature) and that damage causes that many loyalty counters to be removed from him (since he's a planeswalker). Even though he has indestructible, if Gideon, Champion of Justice has no loyalty counters on him, he's put into his owner's graveyard as a state-based action."
      }
    ], 
    "subtypes": [
      "Gideon"
    ], 
    "text": "+1: Put a loyalty counter on Gideon, Champion of Justice for each creature target opponent controls.\n0: Until end of turn, Gideon, Champion of Justice becomes a Human Soldier creature with power and toughness each equal to the number of loyalty counters on him and gains indestructible. He's still a planeswalker. Prevent all damage that would be dealt to him this turn.\n−15: Exile all other permanents.", 
    "type": "Planeswalker — Gideon", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "W", 
      "U", 
      "G"
    ], 
    "colors": [
      "White", 
      "Blue", 
      "Green"
    ], 
    "imageName": "tamiyo, field researcher", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Shadows over Innistrad Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Standard", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{1}{G}{W}{U}", 
    "name": "Tamiyo, Field Researcher", 
    "printings": [
      "EMN"
    ], 
    "rulings": [
      {
        "date": "2016-07-13", 
        "text": "Tamiyo's first ability can target creatures you don't control. You'll draw a card, not their controller, if they deal combat damage."
      }, 
      {
        "date": "2016-07-13", 
        "text": "Tamiyo's first ability sets up a delayed triggered ability that triggers even if Tamiyo has left the battlefield before those creatures deal combat damage."
      }, 
      {
        "date": "2016-07-13", 
        "text": "You must follow the normal timing permissions and restrictions of each nonland card you cast once you get Tamiyo's emblem."
      }, 
      {
        "date": "2016-07-13", 
        "text": "If you cast a card \"without paying its mana cost,\" you can't pay any alternative costs such as emerge costs. You can pay additional costs such as escalate costs. If the card has mandatory additional costs, you must pay those."
      }, 
      {
        "date": "2016-07-13", 
        "text": "If the card has {X} in its mana cost, you must choose 0 as the value of X when casting it without paying its mana cost."
      }, 
      {
        "date": "2016-07-13", 
        "text": "You may still cast nonland cards by paying their mana costs as normal."
      }
    ], 
    "subtypes": [
      "Tamiyo"
    ], 
    "text": "+1: Choose up to two target creatures. Until your next turn, whenever either of those creatures deals combat damage, you draw a card.\n−2: Tap up to two target nonland permanents. They don't untap during their controller's next untap step.\n−7: Draw three cards. You get an emblem with \"You may cast nonland cards from your hand without paying their mana costs.\"", 
    "type": "Planeswalker — Tamiyo", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "R", 
      "G"
    ], 
    "colors": [
      "Red", 
      "Green"
    ], 
    "imageName": "sarkhan vol", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Shards of Alara Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{2}{R}{G}", 
    "name": "Sarkhan Vol", 
    "printings": [
      "ALA", 
      "MMA"
    ], 
    "rulings": [
      {
        "date": "2008-10-01", 
        "text": "You may activate the first ability even if you control no creatures. Sarkhan Vol gains a loyalty counter, but the ability will have no effect."
      }, 
      {
        "date": "2008-10-01", 
        "text": "Sarkhan Vol's first ability affects only creatures you control when that ability resolves."
      }, 
      {
        "date": "2008-10-01", 
        "text": "You may target any creature with the second ability, not just a creature an opponent controls. If you target a creature you already control, you'll gain control of it (which will usually have no visible effect), it'll untap, and it'll gain haste until end of turn."
      }
    ], 
    "subtypes": [
      "Sarkhan"
    ], 
    "text": "+1: Creatures you control get +1/+1 and gain haste until end of turn.\n−2: Gain control of target creature until end of turn. Untap that creature. It gains haste until end of turn.\n−6: Create five 4/4 red Dragon creature tokens with flying.", 
    "type": "Planeswalker — Sarkhan", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 6, 
    "colorIdentity": [
      "R"
    ], 
    "colors": [
      "Red"
    ], 
    "imageName": "chandra, pyrogenius", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Kaladesh Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Standard", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 5, 
    "manaCost": "{4}{R}{R}", 
    "name": "Chandra, Pyrogenius", 
    "printings": [
      "KLD"
    ], 
    "rulings": [
      {
        "date": "2016-09-20", 
        "text": "The last ability of Chandra, Pyrogenius doesn't target the creatures. A creature with hexproof the target player controls will be dealt damage this way."
      }, 
      {
        "date": "2016-09-20", 
        "text": "In a Two-Headed Giant game, Chandra's first ability causes 4 damage total to be dealt to the opposing team."
      }
    ], 
    "subtypes": [
      "Chandra"
    ], 
    "text": "+2: Chandra, Pyrogenius deals 2 damage to each opponent.\n−3: Chandra, Pyrogenius deals 4 damage to target creature.\n−10: Chandra, Pyrogenius deals 6 damage to target player and each creature he or she controls.", 
    "type": "Planeswalker — Chandra", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "W"
    ], 
    "colors": [
      "White"
    ], 
    "imageName": "ajani goldmane", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Lorwyn-Shadowmoor Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{2}{W}{W}", 
    "name": "Ajani Goldmane", 
    "printings": [
      "pPRO", 
      "LRW", 
      "M10", 
      "M11"
    ], 
    "rulings": [
      {
        "date": "2007-10-01", 
        "text": "The vigilance granted to a creature by the second ability remains until the end of the turn even if the +1/+1 counter is removed."
      }, 
      {
        "date": "2007-10-01", 
        "text": "The power and toughness of the Avatar created by the third ability will change as your life total changes."
      }
    ], 
    "subtypes": [
      "Ajani"
    ], 
    "text": "+1: You gain 2 life.\n−1: Put a +1/+1 counter on each creature you control. Those creatures gain vigilance until end of turn.\n−6: Create a white Avatar creature token. It has \"This creature's power and toughness are each equal to your life total.\"", 
    "type": "Planeswalker — Ajani", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 3, 
    "colorIdentity": [
      "R"
    ], 
    "colors": [
      "Red"
    ], 
    "imageName": "chandra, roaring flame", 
    "layout": "double-faced", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "name": "Chandra, Roaring Flame", 
    "names": [
      "Chandra, Fire of Kaladesh", 
      "Chandra, Roaring Flame"
    ], 
    "printings": [
      "ORI"
    ], 
    "rulings": [
      {
        "date": "2015-06-22", 
        "text": "The emblem created by Chandra, Roaring Flame is colorless. The damage it deals is from a colorless source."
      }, 
      {
        "date": "2015-06-22", 
        "text": "Only players actually dealt damage by the third ability of Chandra, Roaring Flame will get an emblem. If all of that damage to a player is prevented, that player won't get an emblem. If any of that damage is redirected to Chandra's controller, that player will get an emblem."
      }, 
      {
        "date": "2015-06-22", 
        "text": "Each player who gets Chandra's emblem is the owner of that emblem. In multiplayer games, that emblem will remain in the game as long as its owner does, even if Chandra's owner leaves the game."
      }
    ], 
    "subtypes": [
      "Chandra"
    ], 
    "text": "+1: Chandra, Roaring Flame deals 2 damage to target player.\n−2: Chandra, Roaring Flame deals 2 damage to target creature.\n−7: Chandra, Roaring Flame deals 6 damage to each opponent. Each player dealt damage this way gets an emblem with \"At the beginning of your upkeep, this emblem deals 3 damage to you.\"", 
    "type": "Planeswalker — Chandra", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 5, 
    "colorIdentity": [
      "U"
    ], 
    "colors": [
      "Blue"
    ], 
    "imageName": "tamiyo, the moon sage", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Innistrad Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{3}{U}{U}", 
    "name": "Tamiyo, the Moon Sage", 
    "printings": [
      "AVR"
    ], 
    "rulings": [
      {
        "date": "2012-05-01", 
        "text": "Tamiyo's first ability tracks the permanent, but not its controller. If the permanent changes controllers before its first controller's next untap step has come around, then it won't untap during its new controller's next untap step."
      }, 
      {
        "date": "2012-05-01", 
        "text": "The number of tapped creatures the player controls is determined when Tamiyo's second ability resolves."
      }, 
      {
        "date": "2012-05-01", 
        "text": "Tamiyo's third ability creates one emblem with two abilities."
      }, 
      {
        "date": "2012-05-01", 
        "text": "If you activate Tamiyo's third ability when she has eight loyalty counters on her, she'll be put into your graveyard before the emblem is created. She won't return to your hand."
      }, 
      {
        "date": "2012-05-01", 
        "text": "Cards that are put into your graveyard can be returned to your hand by the emblem's ability even if they were never in your hand."
      }, 
      {
        "date": "2013-07-01", 
        "text": "The ability can target a tapped permanent. If the targeted permanent is already tapped when it resolves, that permanent just remains tapped and doesn't untap during its controller's next untap step."
      }
    ], 
    "subtypes": [
      "Tamiyo"
    ], 
    "text": "+1: Tap target permanent. It doesn't untap during its controller's next untap step.\n−2: Draw a card for each tapped creature target player controls.\n−8: You get an emblem with \"You have no maximum hand size\" and \"Whenever a card is put into your graveyard from anywhere, you may return it to your hand.\"", 
    "type": "Planeswalker — Tamiyo", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 3, 
    "colorIdentity": [
      "W"
    ], 
    "colors": [
      "White"
    ], 
    "imageName": "ajani, caller of the pride", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{1}{W}{W}", 
    "name": "Ajani, Caller of the Pride", 
    "printings": [
      "pMEI", 
      "M13", 
      "M14"
    ], 
    "rulings": [
      {
        "date": "2012-07-01", 
        "text": "You can activate the first ability without a target. You'll still put one loyalty counter on Ajani when you activate the ability."
      }, 
      {
        "date": "2012-07-01", 
        "text": "The number of Cat tokens you put onto the battlefield is equal to your life total when the third ability resolves."
      }
    ], 
    "subtypes": [
      "Ajani"
    ], 
    "text": "+1: Put a +1/+1 counter on up to one target creature.\n−3: Target creature gains flying and double strike until end of turn.\n−8: Create X 2/2 white Cat creature tokens, where X is your life total.", 
    "type": "Planeswalker — Ajani", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "W", 
      "R"
    ], 
    "colors": [
      "White", 
      "Red"
    ], 
    "imageName": "ajani vengeant", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Shards of Alara Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{2}{R}{W}", 
    "name": "Ajani Vengeant", 
    "printings": [
      "pPRE", 
      "pLPA", 
      "ALA", 
      "DDH"
    ], 
    "rulings": [
      {
        "date": "2008-10-01", 
        "text": "You may target any permanent with Ajani Vengeant's first ability. It doesn't have to be tapped."
      }, 
      {
        "date": "2008-10-01", 
        "text": "The first ability tracks the permanent, but not its controller. If the permanent changes controllers before its first controller's next untap step has come around, then it won't untap during its new controller's next untap step."
      }
    ], 
    "subtypes": [
      "Ajani"
    ], 
    "text": "+1: Target permanent doesn't untap during its controller's next untap step.\n−2: Ajani Vengeant deals 3 damage to target creature or player and you gain 3 life.\n−7: Destroy all lands target player controls.", 
    "type": "Planeswalker — Ajani", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 8, 
    "colorIdentity": [
      "U", 
      "B", 
      "R"
    ], 
    "colors": [
      "Blue", 
      "Black", 
      "Red"
    ], 
    "imageName": "nicol bolas, planeswalker", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Shards of Alara Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 5, 
    "manaCost": "{4}{U}{B}{B}{R}", 
    "name": "Nicol Bolas, Planeswalker", 
    "printings": [
      "CON", 
      "DDH", 
      "M13"
    ], 
    "rulings": [
      {
        "date": "2009-02-01", 
        "text": "The control-change effect has no duration. It will last until the game ends or the affected creature leaves the battlefield. It may be superseded by a later control-change effect."
      }, 
      {
        "date": "2012-07-01", 
        "text": "If the damage from Nicol Bolas's third ability is prevented or redirected, the rest of the effect will still happen. Specifically, the number of cards discarded and permanents sacrificed isn't tied to the amount of damage dealt."
      }, 
      {
        "date": "2012-07-01", 
        "text": "For the third ability, if the player is an illegal target when the ability tries to resolve, the ability is countered and none of its effects will happen. No damage will be dealt, no cards will be discarded, and no permanents will be sacrificed."
      }
    ], 
    "subtypes": [
      "Bolas"
    ], 
    "text": "+3: Destroy target noncreature permanent.\n−2: Gain control of target creature.\n−9: Nicol Bolas, Planeswalker deals 7 damage to target player. That player discards seven cards, then sacrifices seven permanents.", 
    "type": "Planeswalker — Bolas", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 3, 
    "colorIdentity": [
      "U"
    ], 
    "colors": [
      "Blue"
    ], 
    "imageName": "jace beleren", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Lorwyn-Shadowmoor Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{1}{U}{U}", 
    "name": "Jace Beleren", 
    "printings": [
      "pMEI", 
      "LRW", 
      "DD2", 
      "M10", 
      "M11", 
      "DD3_JVC"
    ], 
    "rulings": [
      {
        "date": "2009-10-01", 
        "text": "If there are fewer than twenty cards in the targeted player's library, that player puts all the cards from his or her library into his or her graveyard."
      }
    ], 
    "subtypes": [
      "Jace"
    ], 
    "text": "+2: Each player draws a card.\n−1: Target player draws a card.\n−10: Target player puts the top twenty cards of his or her library into his or her graveyard.", 
    "type": "Planeswalker — Jace", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 5, 
    "colorIdentity": [
      "U"
    ], 
    "colors": [
      "Blue"
    ], 
    "imageName": "jace, unraveler of secrets", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Shadows over Innistrad Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Standard", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 5, 
    "manaCost": "{3}{U}{U}", 
    "name": "Jace, Unraveler of Secrets", 
    "printings": [
      "SOI"
    ], 
    "rulings": [
      {
        "date": "2016-04-08", 
        "text": "The emblem's triggered ability counters the first spell an opponent casts on each turn, not just that opponent's turn."
      }, 
      {
        "date": "2016-04-08", 
        "text": "If Jace's emblem's triggered ability doesn't counter the first spell an opponent casts (perhaps because that spell can't be countered), it won't trigger again in the same turn to try to counter that player's second spell."
      }, 
      {
        "date": "2016-04-08", 
        "text": "If you have multiple opponents, Jace's emblem can trigger once each turn for each opponent."
      }
    ], 
    "subtypes": [
      "Jace"
    ], 
    "text": "+1: Scry 1, then draw a card.\n−2: Return target creature to its owner's hand.\n−8: You get an emblem with \"Whenever an opponent casts his or her first spell each turn, counter that spell.\"", 
    "type": "Planeswalker — Jace", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "W", 
      "B"
    ], 
    "colors": [
      "White", 
      "Black"
    ], 
    "imageName": "kaya, ghost assassin", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 5, 
    "manaCost": "{2}{W}{B}", 
    "name": "Kaya, Ghost Assassin", 
    "printings": [
      "CN2"
    ], 
    "rulings": [
      {
        "date": "2016-08-23", 
        "text": "You choose whether or not to target a creature as you activate the first ability. If you chose a target creature, you choose whether to exile Kaya or that creature as the ability resolves. If you chose a creature and that creature is no longer a legal target as the ability tries to resolve, the ability is countered and none of its effects happen. You won't exile Kaya or lose 2 life."
      }, 
      {
        "date": "2016-08-23", 
        "text": "If you didn't choose a target creature for the first ability, and Kaya isn't on the battlefield as the ability resolves, you'll just lose 2 life. No card will be exiled or returned to the battlefield."
      }, 
      {
        "date": "2016-08-23", 
        "text": "As the last ability resolves, each opponent will choose a card to discard and set it aside. Then all those cards are revealed and discarded simultaneously."
      }
    ], 
    "subtypes": [
      "Kaya"
    ], 
    "text": "0: Exile Kaya, Ghost Assassin or up to one target creature. Return that card to the battlefield under its owner's control at the beginning of your next upkeep. You lose 2 life.\n−1: Each opponent loses 2 life and you gain 2 life.\n−2: Each opponent discards a card and you draw a card.", 
    "type": "Planeswalker — Kaya", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "R"
    ], 
    "colors": [
      "Red"
    ], 
    "imageName": "daretti, scrap savant", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{3}{R}", 
    "name": "Daretti, Scrap Savant", 
    "printings": [
      "C14", 
      "C16"
    ], 
    "rulings": [
      {
        "date": "2014-11-07", 
        "text": "You may choose to discard zero cards as the first ability resolves. In that case, you won't draw any cards."
      }, 
      {
        "date": "2014-11-07", 
        "text": "You choose which artifact to sacrifice as the second ability resolves. You must sacrifice an artifact if you control at least one at that time. For example, if you control two artifacts when you activate the second ability, but the artifact you intended to sacrifice is destroyed in response, you must sacrifice the other artifact as the ability resolves."
      }, 
      {
        "date": "2014-11-07", 
        "text": "The ability of Daretti's emblem will return the artifact card only if it's still in your graveyard when the delayed triggered ability resolves at the beginning of the next end step. If the artifact card left your graveyard before that point (even if it was put back into your graveyard), the ability won't return it to the battlefield."
      }
    ], 
    "subtypes": [
      "Daretti"
    ], 
    "text": "+2: Discard up to two cards, then draw that many cards.\n−2: Sacrifice an artifact. If you do, return target artifact card from your graveyard to the battlefield.\n−10: You get an emblem with \"Whenever an artifact is put into your graveyard from the battlefield, return that card to the battlefield at the beginning of the next end step.\"\nDaretti, Scrap Savant can be your commander.", 
    "type": "Planeswalker — Daretti", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 5, 
    "colorIdentity": [
      "R"
    ], 
    "colors": [
      "Red"
    ], 
    "imageName": "chandra nalaar", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Lorwyn-Shadowmoor Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 6, 
    "manaCost": "{3}{R}{R}", 
    "name": "Chandra Nalaar", 
    "printings": [
      "LRW", 
      "DD2", 
      "M10", 
      "M11", 
      "DD3_JVC"
    ], 
    "rulings": [
      {
        "date": "2007-10-01", 
        "text": "To activate the second ability, you choose a value of X equal to or less than the number of loyalty counters on Chandra Nalaar. You may choose 0. You can't choose a negative number."
      }
    ], 
    "subtypes": [
      "Chandra"
    ], 
    "text": "+1: Chandra Nalaar deals 1 damage to target player.\n−X: Chandra Nalaar deals X damage to target creature.\n−8: Chandra Nalaar deals 10 damage to target player and each creature he or she controls.", 
    "type": "Planeswalker — Chandra", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 1, 
    "colorIdentity": [
      "W"
    ], 
    "colors": [
      "White"
    ], 
    "imageName": "gideon, battle-forged", 
    "layout": "double-faced", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "name": "Gideon, Battle-Forged", 
    "names": [
      "Kytheon, Hero of Akros", 
      "Gideon, Battle-Forged"
    ], 
    "printings": [
      "ORI"
    ], 
    "rulings": [
      {
        "date": "2015-06-22", 
        "text": "Gideon's first ability causes a creature to attack him if able. If, during its controller's declare attackers step, that creature is tapped, is affected by a spell or ability that says it can't attack, or hasn't been under its controller's control continuously since that player's turn began, then that creature doesn't attack. If there's a cost associated with having that creature attack, its controller isn't forced to pay that cost. If he or she doesn't, the creature doesn't have to attack."
      }, 
      {
        "date": "2015-06-22", 
        "text": "If Gideon can't be attacked, perhaps because he has left the battlefield before the creature's controller's next combat, the creature targeted by Gideon's first ability can attack you or another planeswalker you control, or its controller can choose to have it not attack at all."
      }, 
      {
        "date": "2015-06-22", 
        "text": "If the creature targeted by Gideon's first ability changes controllers before it has the chance to attack Gideon, the ability will apply to it during its new controller's next turn."
      }, 
      {
        "date": "2015-06-22", 
        "text": "If Gideon becomes a creature due to his third ability, that doesn't count as having a creature enter the battlefield. Gideon was already on the battlefield; he only changed his types. Abilities that trigger whenever a creature enters the battlefield won't trigger."
      }, 
      {
        "date": "2015-06-22", 
        "text": "Gideon's third ability causes him to become a creature with the creature types Human Soldier. He remains a planeswalker with the planeswalker type Gideon. (He also retains any other card types or subtypes he may have had.) Each subtype is correlated to the proper card type: Gideon is just a planeswalker type (not a creature type), and Human and Soldier are just creature types (not planeswalker types)."
      }, 
      {
        "date": "2015-06-22", 
        "text": "If you activate Gideon's third ability and then damage is dealt to him that can't be prevented, that damage has all applicable results: specifically, the damage is marked on Gideon (since he's a creature) and that damage causes that many loyalty counters to be removed from him (since he's a planeswalker). If Gideon has no loyalty counters on him, he's put into his owner's graveyard as a state-based action. (As long as he still has indestructible, the marked damage won't cause him to be destroyed.)"
      }, 
      {
        "date": "2015-06-22", 
        "text": "Say you activate Gideon's third ability, then an opponent gains control of him before combat. You may have any of your creatures attack Gideon (since he's still a planeswalker). Then Gideon may block (since he's a creature). He may block any eligible attacking creature, including one that's attacking him. During combat, he behaves as an attacked planeswalker and/or a blocking creature, as appropriate. For example, he deals combat damage to any creatures he's blocking, but he doesn't deal combat damage to any unblocked creatures that are attacking him."
      }
    ], 
    "subtypes": [
      "Gideon"
    ], 
    "text": "+2: Up to one target creature an opponent controls attacks Gideon, Battle-Forged during its controller's next turn if able.\n+1: Until your next turn, target creature gains indestructible. Untap that creature.\n0: Until end of turn, Gideon, Battle-Forged becomes a 4/4 Human Soldier creature with indestructible that's still a planeswalker. Prevent all damage that would be dealt to him this turn.", 
    "type": "Planeswalker — Gideon", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "R"
    ], 
    "colors": [
      "Red"
    ], 
    "imageName": "koth of the hammer", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Scars of Mirrodin Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{2}{R}{R}", 
    "name": "Koth of the Hammer", 
    "printings": [
      "SOM", 
      "DDI"
    ], 
    "rulings": [
      {
        "date": "2011-01-01", 
        "text": "Emblems behave similarly to enchantments: They have an ability that, in a general sense, continually affects the game. The primary difference between them is that emblems aren't permanents and don't exist on the battlefield. Nothing in the game can remove an emblem, simply because no other spell or ability references them. Once you get an emblem, you keep it for the rest of the game. Emblems have no color, name, card type, or other characteristics beyond the listed ability"
      }, 
      {
        "date": "2011-01-01", 
        "text": "Koth's first ability can target any Mountain, including an untapped Mountain and/or a Mountain another player controls."
      }, 
      {
        "date": "2011-01-01", 
        "text": "If Koth's first ability animates a Mountain that came under your control that turn, it will have \"summoning sickness\" and be unable to attack. It will also be unable to be tapped to activate an ability with the {T} symbol in its cost, such as the Mountain's mana ability or the ability granted to it by Koth's emblem."
      }, 
      {
        "date": "2011-01-01", 
        "text": "Loyalty abilities can't be mana abilities. Koth's second ability uses the stack and can be countered or otherwise responded to. Like all loyalty abilities, it can be activated only once per turn, during your main phase, when the stack is empty, and only if no other loyalty abilities of this permanent have been activated this turn."
      }, 
      {
        "date": "2011-01-01", 
        "text": "Koth's emblem grants an activated ability to each Mountain you control at any given time for the rest of the game. It will continuously check which permanents you control are Mountains to determine what has the ability. For example, a Mountain that comes under your control later in the game will have the ability, while a Mountain you controlled at the time the emblem was created, but that later came under the control of another player, will no longer have the ability."
      }
    ], 
    "subtypes": [
      "Koth"
    ], 
    "text": "+1: Untap target Mountain. It becomes a 4/4 red Elemental creature until end of turn. It's still a land.\n−2: Add {R} to your mana pool for each Mountain you control.\n−5: You get an emblem with \"Mountains you control have ‘{T}: This land deals 1 damage to target creature or player.'\"", 
    "type": "Planeswalker — Koth", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 2, 
    "colorIdentity": [
      "U"
    ], 
    "colors": [
      "Blue"
    ], 
    "imageName": "jace, telepath unbound", 
    "layout": "double-faced", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 5, 
    "name": "Jace, Telepath Unbound", 
    "names": [
      "Jace, Vryn's Prodigy", 
      "Jace, Telepath Unbound"
    ], 
    "printings": [
      "ORI"
    ], 
    "rulings": [
      {
        "date": "2015-06-22", 
        "text": "If you activate the second ability of Jace, Telepath Unbound, you must follow the timing rules for the card's types. For example, if you target a sorcery card, you may cast it during your main phase when the stack is empty. You pay all the spell's costs."
      }, 
      {
        "date": "2015-06-22", 
        "text": "If you don't cast the card that turn, nothing happens. It remains in your graveyard."
      }, 
      {
        "date": "2015-06-22", 
        "text": "The card is exiled only if it's cast from the graveyard and put back into the graveyard (either by resolving or being countered). If, at any time, the card goes to a hidden zone (such as your hand or your library), the effect loses track of the card. It won't be exiled, even if that card is put into your graveyard later that turn."
      }
    ], 
    "subtypes": [
      "Jace"
    ], 
    "text": "+1: Up to one target creature gets -2/-0 until your next turn.\n−3: You may cast target instant or sorcery card from your graveyard this turn. If that card would be put into your graveyard this turn, exile it instead.\n−9: You get an emblem with \"Whenever you cast a spell, target opponent puts the top five cards of his or her library into his or her graveyard.\"", 
    "type": "Planeswalker — Jace", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "U", 
      "B"
    ], 
    "colors": [
      "Blue", 
      "Black"
    ], 
    "imageName": "tezzeret, agent of bolas", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Freeform", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Prismatic", 
        "legality": "Legal"
      }, 
      {
        "format": "Scars of Mirrodin Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Singleton 100", 
        "legality": "Legal"
      }, 
      {
        "format": "Tribal Wars Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{2}{U}{B}", 
    "name": "Tezzeret, Agent of Bolas", 
    "printings": [
      "MBS"
    ], 
    "rulings": [
      {
        "date": "2011-06-01", 
        "text": "The artifact targeted by the second ability will retain any types, subtypes, or supertypes it has. Notably, if an Equipment becomes an artifact creature, it can't be attached to another creature. If it was attached to a creature, it becomes unattached."
      }, 
      {
        "date": "2011-06-01", 
        "text": "If the target of the second ability is already an artifact creature, its power and toughness will each become 5. This overwrites all previous effects that set the creature's power and toughness to specific values. Any power- or toughness-setting effects that start to apply after this ability resolves will overwrite this effect."
      }, 
      {
        "date": "2011-06-01", 
        "text": "Effects that modify that creature's power or toughness, such as the effects of Giant Growth, will apply to it no matter when they started to take effect. The same is true for counters that change the creature's power or toughness (such as -1/-1 counters) and effects that switch its power and toughness."
      }, 
      {
        "date": "2011-06-01", 
        "text": "The number of artifacts you control is counted when the last ability resolves, not when it is activated."
      }, 
      {
        "date": "2013-07-01", 
        "text": "Planeswalkers are permanents. You can cast one at the time you could cast a sorcery. When your planeswalker spell resolves, it enters the battlefield under your control."
      }, 
      {
        "date": "2013-07-01", 
        "text": "Planeswalkers are not creatures. Spells and abilities that affect creatures won't affect them."
      }, 
      {
        "date": "2013-07-01", 
        "text": "Planeswalkers have loyalty. A planeswalker enters the battlefield with a number of loyalty counters on it equal to the number printed in its lower right corner. Activating one of its abilities may cause it to gain or lose loyalty counters. Damage dealt to a planeswalker causes that many loyalty counters to be removed from it. If it has no loyalty counters on it, it's put into its owner's graveyard as a state-based action."
      }, 
      {
        "date": "2013-07-01", 
        "text": "Planeswalkers each have a number of activated abilities called \"loyalty abilities.\" You can activate a loyalty ability of a planeswalker you control only at the time you could cast a sorcery and only if you haven't activated one of that planeswalker's loyalty abilities yet that turn."
      }, 
      {
        "date": "2013-07-01", 
        "text": "The cost to activate a planeswalker's loyalty ability is represented by a symbol with a number inside. Up-arrows contain positive numbers, such as \"+1\"; this means \"Put one loyalty counter on this planeswalker.\" Down-arrows contain negative numbers, such as \"-7\"; this means \"Remove seven loyalty counters from this planeswalker.\" A symbol with a \"0\" means \"Put zero loyalty counters on this planeswalker.\""
      }, 
      {
        "date": "2013-07-01", 
        "text": "You can't activate a planeswalker's ability with a negative loyalty cost unless the planeswalker has at least that many loyalty counters on it."
      }, 
      {
        "date": "2013-07-01", 
        "text": "Planeswalkers can't attack (unless an effect turns the planeswalker into a creature). However, they can be attacked. Each of your attacking creatures can attack your opponent or a planeswalker that player controls. You say which as you declare attackers."
      }, 
      {
        "date": "2013-07-01", 
        "text": "If your planeswalkers are being attacked, you can block the attackers as normal."
      }, 
      {
        "date": "2013-07-01", 
        "text": "If a creature that's attacking a planeswalker isn't blocked, it'll deal its combat damage to that planeswalker. Damage dealt to a planeswalker causes that many loyalty counters to be removed from it."
      }, 
      {
        "date": "2013-07-01", 
        "text": "If a source you control would deal noncombat damage to an opponent, you may have that source deal that damage to a planeswalker that opponent controls instead. For example, although you can't target a planeswalker with Shock, you can target your opponent with Shock, and then as Shock resolves, choose to have Shock deal its 2 damage to one of your opponent's planeswalkers. (You can't split up that damage between different players and/or planeswalkers.) If you have Shock deal its damage to a planeswalker, two loyalty counters are removed from it."
      }, 
      {
        "date": "2013-07-01", 
        "text": "If a player controls two or more planeswalkers that share a planeswalker type, that player chooses one of them and the rest are put into their owners' graveyards as a state-based action."
      }
    ], 
    "subtypes": [
      "Tezzeret"
    ], 
    "text": "+1: Look at the top five cards of your library. You may reveal an artifact card from among them and put it into your hand. Put the rest on the bottom of your library in any order.\n−1: Target artifact becomes an artifact creature with base power and toughness 5/5.\n−4: Target player loses X life and you gain X life, where X is twice the number of artifacts you control.", 
    "type": "Planeswalker — Tezzeret", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 5, 
    "colorIdentity": [
      "G"
    ], 
    "colors": [
      "Green"
    ], 
    "imageName": "freyalise, llanowar's fury", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{3}{G}{G}", 
    "name": "Freyalise, Llanowar's Fury", 
    "printings": [
      "C14"
    ], 
    "subtypes": [
      "Freyalise"
    ], 
    "text": "+2: Create a 1/1 green Elf Druid creature token with \"{T}: Add {G} to your mana pool.\"\n−2: Destroy target artifact or enchantment.\n−6: Draw a card for each green creature you control.\nFreyalise, Llanowar's Fury can be your commander.", 
    "type": "Planeswalker — Freyalise", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "U", 
      "G"
    ], 
    "colors": [
      "Blue", 
      "Green"
    ], 
    "imageName": "kiora, the crashing wave", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Theros Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 2, 
    "manaCost": "{2}{G}{U}", 
    "name": "Kiora, the Crashing Wave", 
    "printings": [
      "BNG", 
      "DDO"
    ], 
    "rulings": [
      {
        "date": "2014-02-01", 
        "text": "Kiora's first ability can target any permanent an opponent controls, not just one that can deal or be dealt damage."
      }, 
      {
        "date": "2014-02-01", 
        "text": "Once the first ability resolves, the damage prevention continues to apply even if that permanent changes controllers."
      }, 
      {
        "date": "2014-02-01", 
        "text": "Kiora's second ability allows you to play an additional land during your main phase. Doing so follows the normal timing rules for playing lands. In particular, you won't play a land as that ability resolves. The ability will fully resolve (and you'll draw a card, perhaps a land you'll play later) first."
      }, 
      {
        "date": "2014-02-01", 
        "text": "The effect of the second ability is cumulative with other effects that let you play additional lands, such as the one from Rites of Flourishing."
      }, 
      {
        "date": "2014-02-01", 
        "text": "If Kiora leaves the battlefield after her second ability is activated but before it resolves, you'll still be able to play an additional land after the ability resolves."
      }
    ], 
    "subtypes": [
      "Kiora"
    ], 
    "text": "+1: Until your next turn, prevent all damage that would be dealt to and dealt by target permanent an opponent controls.\n−1: Draw a card. You may play an additional land this turn.\n−5: You get an emblem with \"At the beginning of your end step, create a 9/9 blue Kraken creature token.\"", 
    "type": "Planeswalker — Kiora", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "R", 
      "G"
    ], 
    "colors": [
      "Red", 
      "Green"
    ], 
    "imageName": "xenagos, the reveler", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Theros Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{2}{R}{G}", 
    "name": "Xenagos, the Reveler", 
    "printings": [
      "THS"
    ], 
    "rulings": [
      {
        "date": "2013-09-15", 
        "text": "Xenagos's first ability isn't a mana ability. It uses the stack and can be responded to. Count the number of creatures you control as the ability resolves to determine how much mana to add to your mana pool. You choose how much of that mana is red and how much is green at that time."
      }, 
      {
        "date": "2013-09-15", 
        "text": "Creature cards with bestow put onto the battlefield with the third ability will be creatures on the battlefield, not Auras."
      }
    ], 
    "subtypes": [
      "Xenagos"
    ], 
    "text": "+1: Add X mana in any combination of {R} and/or {G} to your mana pool, where X is the number of creatures you control.\n0: Create a 2/2 red and green Satyr creature token with haste.\n−6: Exile the top seven cards of your library. You may put any number of creature and/or land cards from among them onto the battlefield.", 
    "type": "Planeswalker — Xenagos", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 3, 
    "colorIdentity": [
      "G"
    ], 
    "colors": [
      "Green"
    ], 
    "imageName": "nissa, voice of zendikar", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Battle for Zendikar Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Standard", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{1}{G}{G}", 
    "name": "Nissa, Voice of Zendikar", 
    "printings": [
      "OGW", 
      "DDR"
    ], 
    "subtypes": [
      "Nissa"
    ], 
    "text": "+1: Create a 0/1 green Plant creature token.\n−2: Put a +1/+1 counter on each creature you control.\n−7: You gain X life and draw X cards, where X is the number of lands you control.", 
    "type": "Planeswalker — Nissa", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 5, 
    "colorIdentity": [
      "G"
    ], 
    "colors": [
      "Green"
    ], 
    "imageName": "nissa, vital force", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Kaladesh Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Standard", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 5, 
    "manaCost": "{3}{G}{G}", 
    "name": "Nissa, Vital Force", 
    "printings": [
      "KLD"
    ], 
    "rulings": [
      {
        "date": "2016-09-20", 
        "text": "You can activate Nissa's first ability targeting a land that's already untapped."
      }, 
      {
        "date": "2016-09-20", 
        "text": "After resolving Nissa's first ability, the target land still has any abilities it had before it became a creature and any other types it had."
      }, 
      {
        "date": "2016-09-20", 
        "text": "A permanent card is an artifact, creature, enchantment, land, or planeswalker card."
      }
    ], 
    "subtypes": [
      "Nissa"
    ], 
    "text": "+1: Untap target land you control. Until your next turn, it becomes a 5/5 Elemental creature with haste. It's still a land.\n−3: Return target permanent card from your graveyard to your hand.\n−6: You get an emblem with \"Whenever a land enters the battlefield under your control, you may draw a card.\"", 
    "type": "Planeswalker — Nissa", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 7, 
    "colorIdentity": [
      "B", 
      "G"
    ], 
    "colors": [
      "Black", 
      "Green"
    ], 
    "imageName": "garruk, apex predator", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 5, 
    "manaCost": "{5}{B}{G}", 
    "name": "Garruk, Apex Predator", 
    "printings": [
      "pMEI", 
      "M15"
    ], 
    "rulings": [
      {
        "date": "2014-07-18", 
        "text": "The first ability can target and destroy a Garruk planeswalker controlled by another player."
      }, 
      {
        "date": "2014-07-18", 
        "text": "If you activate the third ability, and the target creature is an illegal target when the ability tries to resolve, it will be countered and none of its effects will happen. You won't gain any life."
      }, 
      {
        "date": "2014-07-18", 
        "text": "The emblem's ability won't trigger if a creature attacks a planeswalker."
      }, 
      {
        "date": "2014-07-18", 
        "text": "The emblem is owned and controlled by the target of the ability that created it. In a multiplayer game, if Garruk's owner leaves the game, the emblem does not."
      }
    ], 
    "subtypes": [
      "Garruk"
    ], 
    "text": "+1: Destroy another target planeswalker.\n+1: Create a 3/3 black Beast creature token with deathtouch.\n−3: Destroy target creature. You gain life equal to its toughness.\n−8: Target opponent gets an emblem with \"Whenever a creature attacks you, it gets +5/+5 and gains trample until end of turn.\"", 
    "type": "Planeswalker — Garruk", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "R"
    ], 
    "colors": [
      "Red"
    ], 
    "imageName": "chandra, the firebrand", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{3}{R}", 
    "name": "Chandra, the Firebrand", 
    "printings": [
      "M12", 
      "M13"
    ], 
    "rulings": [
      {
        "date": "2011-09-22", 
        "text": "Chandra's second ability creates a delayed triggered ability that will copy the next instant or sorcery spell you cast that turn, regardless of whether that spell has targets."
      }, 
      {
        "date": "2011-09-22", 
        "text": "When the delayed trigger resolves, it creates a copy of a spell. You control the copy. That copy is created on the stack, so it's not \"cast.\" Abilities that trigger when a player casts a spell won't trigger. The copy will then resolve like a normal spell, after players get a chance to cast spells and activate abilities."
      }, 
      {
        "date": "2011-09-22", 
        "text": "The copy will have the same targets as the spell it's copying unless you choose new ones. You may change any number of the targets, including all of them or none of them. If, for one of the targets, you can't choose a new legal target, then it remains unchanged (even if the current target is illegal)."
      }, 
      {
        "date": "2011-09-22", 
        "text": "If the spell Chandra copies is modal (that is, it says \"Choose one --\" or the like), the copy will have the same mode. You can't choose a different one."
      }, 
      {
        "date": "2011-09-22", 
        "text": "If the spell Chandra copies has an X whose value was determined as it was cast (like Consume Spirit does), the copy has the same value of X."
      }, 
      {
        "date": "2011-09-22", 
        "text": "You can't choose to pay any additional costs for the copy. However, effects based on any additional costs that were paid for the original spell are copied as though those same costs were paid for the copy too. For example, if you sacrifice a 3/3 creature to cast Fling after activating Chandra's second ability, the copy of Fling will also deal 3 damage."
      }, 
      {
        "date": "2011-09-22", 
        "text": "When you activate Chandra's last ability, you choose up to six target creatures and/or players. No damage is divided, and Chandra can't deal more than 6 damage to any one target. Chandra deals 6 damage to each target that is still legal when the ability resolves."
      }
    ], 
    "subtypes": [
      "Chandra"
    ], 
    "text": "+1: Chandra, the Firebrand deals 1 damage to target creature or player.\n−2: When you cast your next instant or sorcery spell this turn, copy that spell. You may choose new targets for the copy.\n−6: Chandra, the Firebrand deals 6 damage to each of up to six target creatures and/or players.", 
    "type": "Planeswalker — Chandra", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 5, 
    "colorIdentity": [
      "W", 
      "U"
    ], 
    "colors": [
      "White", 
      "Blue"
    ], 
    "imageName": "venser, the sojourner", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Scars of Mirrodin Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{3}{W}{U}", 
    "name": "Venser, the Sojourner", 
    "printings": [
      "SOM", 
      "DDI"
    ], 
    "rulings": [
      {
        "date": "2011-01-01", 
        "text": "Emblems behave similarly to enchantments: They have an ability that, in a general sense, continually affects the game. The primary difference between them is that emblems aren't permanents and don't exist on the battlefield. Nothing in the game can remove an emblem, simply because no other spell or ability references them. Once you get an emblem, you keep it for the rest of the game. Emblems have no color, name, card type, or other characteristics beyond the listed ability"
      }, 
      {
        "date": "2011-01-01", 
        "text": "The first ability can target any permanent you own, including those another player controls."
      }, 
      {
        "date": "2011-01-01", 
        "text": "If the first ability exiles a token, that token will cease to exist. It won't return to the battlefield."
      }, 
      {
        "date": "2011-01-01", 
        "text": "A permanent exiled by the first ability will return to the battlefield under your control at the beginning of the next end step even if you no longer control Venser at that time."
      }, 
      {
        "date": "2011-01-01", 
        "text": "Venser's second ability doesn't lock in what it applies to. That's because the effect states a true thing about creatures, but doesn't actually change the characteristics of those creatures. As a result, all creatures can't be blocked that turn, including creatures you don't control, creatures that weren't on the battlefield at the time the ability resolved, and creatures that have lost all abilities."
      }, 
      {
        "date": "2011-01-01", 
        "text": "Venser's last ability creates an emblem with a triggered ability. The emblem is the source of the triggered ability. Because emblems are colorless, you can target permanents with protection from white or from blue, for example, with the triggered ability."
      }, 
      {
        "date": "2011-01-01", 
        "text": "Whenever you cast a spell, the emblem's ability triggers and goes on the stack on top of it. It will resolve before the spell does."
      }, 
      {
        "date": "2011-01-01", 
        "text": "If you control more than one such emblem, each one's ability will trigger separately whenever you cast a spell."
      }
    ], 
    "subtypes": [
      "Venser"
    ], 
    "text": "+2: Exile target permanent you own. Return it to the battlefield under your control at the beginning of the next end step.\n−1: Creatures can't be blocked this turn.\n−8: You get an emblem with \"Whenever you cast a spell, exile target permanent.\"", 
    "type": "Planeswalker — Venser", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 6, 
    "colorIdentity": [
      "G"
    ], 
    "colors": [
      "Green"
    ], 
    "imageName": "garruk, caller of beasts", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{4}{G}{G}", 
    "name": "Garruk, Caller of Beasts", 
    "printings": [
      "pMEI", 
      "M14"
    ], 
    "rulings": [
      {
        "date": "2013-07-01", 
        "text": "You choose what green creature card to put onto the battlefield, if any, when the second ability resolves."
      }, 
      {
        "date": "2013-07-01", 
        "text": "If you have Garruk's emblem, the creature card you search for will be put onto the battlefield before the creature spell you cast resolves. The creature card you put onto the battlefield isn't cast, so the ability of the emblem won't retrigger."
      }
    ], 
    "subtypes": [
      "Garruk"
    ], 
    "text": "+1: Reveal the top five cards of your library. Put all creature cards revealed this way into your hand and the rest on the bottom of your library in any order.\n−3: You may put a green creature card from your hand onto the battlefield.\n−7: You get an emblem with \"Whenever you cast a creature spell, you may search your library for a creature card, put it onto the battlefield, then shuffle your library.\"", 
    "type": "Planeswalker — Garruk", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 6, 
    "colorIdentity": [
      "U"
    ], 
    "colors": [
      "Blue"
    ], 
    "imageName": "teferi, temporal archmage", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 5, 
    "manaCost": "{4}{U}{U}", 
    "name": "Teferi, Temporal Archmage", 
    "printings": [
      "C14"
    ], 
    "rulings": [
      {
        "date": "2014-11-07", 
        "text": "If you control Teferi's emblem, the rule that says you can activate a loyalty ability only if none of that permanent's loyalty abilities have been activated that turn still applies. In other words, you could activate a planeswalker's loyalty ability once on your turn and once on each of your opponents' turns."
      }, 
      {
        "date": "2014-11-07", 
        "text": "If you control The Chain Veil (from the Magic 2015 core set) and its activated ability has resolved, and you also control Teferi's emblem, for each planeswalker you control, you can activate one of its loyalty abilities during that turn any time you could cast an instant, and then you may activate a loyalty ability again that turn (choosing the same loyalty ability or a different one) any time you could cast an instant."
      }
    ], 
    "subtypes": [
      "Teferi"
    ], 
    "text": "+1: Look at the top two cards of your library. Put one of them into your hand and the other on the bottom of your library.\n−1: Untap up to four target permanents.\n−10: You get an emblem with \"You may activate loyalty abilities of planeswalkers you control on any player's turn any time you could cast an instant.\"\nTeferi, Temporal Archmage can be your commander.", 
    "type": "Planeswalker — Teferi", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 3, 
    "colorIdentity": [
      "R", 
      "G"
    ], 
    "colors": [
      "Red", 
      "Green"
    ], 
    "imageName": "domri rade", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Return to Ravnica Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{1}{R}{G}", 
    "name": "Domri Rade", 
    "printings": [
      "GTC"
    ], 
    "rulings": [
      {
        "date": "2013-01-24", 
        "text": "When resolving Domri's first ability, if the card you look at isn't a creature card, or it it's a creature card you don't want to put into your hand, you simply put it back on top of your library."
      }, 
      {
        "date": "2013-01-24", 
        "text": "The second target of the second ability can be another creature you control, but it can't be the same creature as the first target."
      }, 
      {
        "date": "2013-01-24", 
        "text": "If either target of the second ability is an illegal target when the ability tries to resolve, neither creature will deal or be dealt damage."
      }, 
      {
        "date": "2013-01-24", 
        "text": "Domri's emblem doesn't remove any other abilities of creatures you control."
      }, 
      {
        "date": "2013-04-15", 
        "text": "If a creature has both double strike and trample, the combat damage it assigned during the first combat damage step will be considered when determining how much damage can trample through in the second combat damage step. If the blocker is destroyed during the first combat damage step, then all of the damage must be assigned to the defending player during the second combat damage step."
      }
    ], 
    "subtypes": [
      "Domri"
    ], 
    "text": "+1: Look at the top card of your library. If it's a creature card, you may reveal it and put it into your hand.\n−2: Target creature you control fights another target creature.\n−7: You get an emblem with \"Creatures you control have double strike, trample, hexproof, and haste.\"", 
    "type": "Planeswalker — Domri", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 6, 
    "colorIdentity": [
      "W", 
      "G"
    ], 
    "colors": [
      "White", 
      "Green"
    ], 
    "imageName": "ajani unyielding", 
    "layout": "normal", 
    "loyalty": 4, 
    "manaCost": "{4}{G}{W}", 
    "name": "Ajani Unyielding", 
    "printings": [
      "AER"
    ], 
    "rulings": [
      {
        "date": "2017-02-09", 
        "text": "A nonland permanent card is an artifact, creature, enchantment, or planeswalker card."
      }, 
      {
        "date": "2017-02-09", 
        "text": "The amount of life gained from Ajani's second ability is equal to power of the creature as it last existed on the battlefield."
      }
    ], 
    "subtypes": [
      "Ajani"
    ], 
    "text": "+2: Reveal the top three cards of your library. Put all nonland permanent cards revealed this way into your hand and the rest on the bottom of your library in any order.\n−2: Exile target creature. Its controller gains life equal to its power.\n−9: Put five +1/+1 counters on each creature you control and five loyalty counters on each other planeswalker you control.", 
    "type": "Planeswalker — Ajani", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 6, 
    "colorIdentity": [
      "B"
    ], 
    "colors": [
      "Black"
    ], 
    "imageName": "sorin markov", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }, 
      {
        "format": "Zendikar Block", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{3}{B}{B}{B}", 
    "name": "Sorin Markov", 
    "printings": [
      "ZEN", 
      "M12"
    ], 
    "rulings": [
      {
        "date": "2009-10-01", 
        "text": "If the targeted creature or player is an illegal target by the time Sorin's first ability resolves, the entire ability is countered. You won't gain life."
      }, 
      {
        "date": "2009-10-01", 
        "text": "For a player's life total to become 10, what actually happens is that the player gains or loses the appropriate amount of life. For example, if the targeted opponent's life total is 4 when this ability resolves, it will cause that player to gain 6 life; alternately, if the targeted player's life total is 17 when this ability resolves, it will cause that player to lose 7 life. Other cards that interact with life gain or life loss will interact with this effect accordingly."
      }, 
      {
        "date": "2009-10-01", 
        "text": "Sorin's third ability allows you to control another player. This effect applies to the next turn that the affected player actually takes."
      }, 
      {
        "date": "2009-10-01", 
        "text": "The player who is being controlled is still the active player."
      }, 
      {
        "date": "2009-10-01", 
        "text": "While controlling another player, you also continue to make your own choices and decisions."
      }, 
      {
        "date": "2009-10-01", 
        "text": "While controlling another player, you make all choices and decisions that player is allowed to make or is told to make during that turn. For example: -- You choose which lands the other player plays. -- You choose which spells the other player casts, and make all decisions as those spells are cast and as they resolve. For example, you choose the value of X for that player's Earthquake, the target for that player's Lightning Bolt, what mana that player spends to cast Day of Judgment, and what card that player gets with Diabolic Tutor. -- You choose which activated abilities the other player activates, and make all decisions as those abilities are activated and as they resolve. For example, you can have your opponent sacrifice his or her creatures to his or her Vampire Aristocrat or have your opponent's Caller of Gales give one of your creatures flying. -- You make all decisions for the other player's triggered abilities, including what they target and any decisions made when they resolve. -- You choose which creatures controlled by the other player attack, who or what they attack, and how they assign their combat damage. -- You make any choices and decisions that player would make for any other reason. For example, you could cast Fact or Fiction, choose that player to divide the revealed cards into piles, and thus divide those cards into piles yourself."
      }, 
      {
        "date": "2009-10-01", 
        "text": "You can't make the affected player concede. That player may choose to concede at any time, even while you're controlling his or her turn."
      }, 
      {
        "date": "2009-10-01", 
        "text": "You can't make any illegal decisions or illegal choices -- you can't do anything that player couldn't do. You can't make choices or decisions for that player that aren't called for by the game rules or by any cards, permanents, spells, abilities, and so on. If an effect causes another player to make decisions that the affected player would normally make (such as Master Warcraft does), that effect takes precedence. (In other words, if the affected player wouldn't make a decision, you wouldn't make that decision on his or her behalf.) You also can't make any choices or decisions for the player that would be called for by the tournament rules (such as whether to take an intentional draw or whether to call a judge)."
      }, 
      {
        "date": "2009-10-01", 
        "text": "You can use only the affected player's resources (cards, mana, and so on) to pay costs for that player; you can't use your own. Similarly, you can use the affected player's resources only to pay that player's costs; you can't spend them on your costs."
      }, 
      {
        "date": "2009-10-01", 
        "text": "You only control the player. You don't control any of the other player's permanents, spells, or abilities."
      }, 
      {
        "date": "2009-10-01", 
        "text": "If the player affected by Sorin's third ability skips his or her next turn, the ability will wait. You'll control the next turn the affected player actually takes."
      }, 
      {
        "date": "2009-10-01", 
        "text": "Multiple player-controlling effects that affect the same player overwrite each other. The last one to be created is the one that works."
      }, 
      {
        "date": "2009-10-01", 
        "text": "You could gain control of yourself using Sorin's third ability, but unless you do so to overwrite someone else's player-controlling effect, this doesn't do anything."
      }, 
      {
        "date": "2010-06-15", 
        "text": "In a Two-Headed Giant game, Sorin's second ability causes the targeted opponent's team's life-total to become 10. Only the targeted player is actually considered to have actually gained or lost life."
      }, 
      {
        "date": "2016-07-13", 
        "text": "While controlling another player, you can see all cards in the game that player can see. This includes cards in that player's hand, face-down cards that player controls, and any cards in that player's library the player may look at."
      }, 
      {
        "date": "2016-07-13", 
        "text": "Controlling a player doesn't allow you to look at that player's sideboard. If an effect instructs that player to choose a card from outside the game, you can't have that player choose any card."
      }
    ], 
    "subtypes": [
      "Sorin"
    ], 
    "text": "+2: Sorin Markov deals 2 damage to target creature or player and you gain 2 life.\n−3: Target opponent's life total becomes 10.\n−7: You control target player during that player's next turn.", 
    "type": "Planeswalker — Sorin", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 3, 
    "colorIdentity": [
      "B"
    ], 
    "colors": [
      "Black"
    ], 
    "imageName": "liliana, defiant necromancer", 
    "layout": "double-faced", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "name": "Liliana, Defiant Necromancer", 
    "names": [
      "Liliana, Heretical Healer", 
      "Liliana, Defiant Necromancer"
    ], 
    "printings": [
      "ORI"
    ], 
    "rulings": [
      {
        "date": "2015-06-22", 
        "text": "When Liliana, Defiant Necromancer's first ability resolves, first you choose a card to discard, then each other player in turn order chooses a card to discard, then all those cards are discarded simultaneously. No one sees what the other players are discarding before deciding which card to discard."
      }
    ], 
    "subtypes": [
      "Liliana"
    ], 
    "text": "+2: Each player discards a card.\n−X: Return target nonlegendary creature card with converted mana cost X from your graveyard to the battlefield.\n−8: You get an emblem with \"Whenever a creature dies, return it to the battlefield under your control at the beginning of the next end step.\"", 
    "type": "Planeswalker — Liliana", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 3, 
    "colorIdentity": [
      "B"
    ], 
    "colors": [
      "Black"
    ], 
    "imageName": "liliana of the veil", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Innistrad Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{1}{B}{B}", 
    "name": "Liliana of the Veil", 
    "printings": [
      "ISD"
    ], 
    "rulings": [
      {
        "date": "2011-09-22", 
        "text": "When the first ability resolves, first you choose a card to discard, then each other player in turn order chooses a card to discard, then all those cards are discarded simultaneously. No one sees what the other players are discarding before deciding which card to discard."
      }, 
      {
        "date": "2011-09-22", 
        "text": "The player targeted by the second ability chooses which creature to sacrifice when the ability resolves. This ability doesn't target any creature."
      }, 
      {
        "date": "2011-09-22", 
        "text": "When the third ability resolves, you put each permanent the player controls into one of the two piles. For example, you could put a creature into one pile and an Aura enchanting that creature into the other pile."
      }, 
      {
        "date": "2011-09-22", 
        "text": "A pile can be empty. If the player chooses an empty pile, no permanents will be sacrificed."
      }
    ], 
    "subtypes": [
      "Liliana"
    ], 
    "text": "+1: Each player discards a card.\n−2: Target player sacrifices a creature.\n−6: Separate all permanents target player controls into two piles. That player sacrifices all permanents in the pile of his or her choice.", 
    "type": "Planeswalker — Liliana", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 5, 
    "colorIdentity": [
      "W"
    ], 
    "colors": [
      "White"
    ], 
    "imageName": "elspeth tirel", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Scars of Mirrodin Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{3}{W}{W}", 
    "name": "Elspeth Tirel", 
    "printings": [
      "SOM"
    ], 
    "rulings": [
      {
        "date": "2011-01-01", 
        "text": "As Elspeth Tirel's last ability resolves, each permanent that isn't a token, a land, or Elspeth Tirel herself is destroyed."
      }
    ], 
    "subtypes": [
      "Elspeth"
    ], 
    "text": "+2: You gain 1 life for each creature you control.\n−2: Create three 1/1 white Soldier creature tokens.\n−5: Destroy all other permanents except for lands and tokens.", 
    "type": "Planeswalker — Elspeth", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 3, 
    "colorIdentity": [
      "B"
    ], 
    "colors": [
      "Black"
    ], 
    "imageName": "liliana, the last hope", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Shadows over Innistrad Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Standard", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{1}{B}{B}", 
    "name": "Liliana, the Last Hope", 
    "printings": [
      "EMN"
    ], 
    "rulings": [
      {
        "date": "2016-07-13", 
        "text": "You can activate Liliana's first ability without any targets just to add a loyalty counter to her."
      }, 
      {
        "date": "2016-07-13", 
        "text": "Liliana's second ability doesn't target the card to return to your hand. After putting the top two cards of your library into your graveyard, you may choose from among any creature cards there."
      }, 
      {
        "date": "2016-07-13", 
        "text": "While resolving the triggered ability of Liliana's emblem, if you control zero Zombies, you'll get two Zombie tokens."
      }
    ], 
    "subtypes": [
      "Liliana"
    ], 
    "text": "+1: Up to one target creature gets -2/-1 until your next turn.\n−2: Put the top two cards of your library into your graveyard, then you may return a creature card from your graveyard to your hand.\n−7: You get an emblem with \"At the beginning of your end step, create X 2/2 black Zombie creature tokens, where X is two plus the number of Zombies you control.\"", 
    "type": "Planeswalker — Liliana", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 6, 
    "colorIdentity": [
      "W"
    ], 
    "colors": [
      "White"
    ], 
    "imageName": "elspeth, sun's champion", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Theros Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{4}{W}{W}", 
    "name": "Elspeth, Sun's Champion", 
    "printings": [
      "THS", 
      "DDO"
    ], 
    "subtypes": [
      "Elspeth"
    ], 
    "text": "+1: Create three 1/1 white Soldier creature tokens.\n−3: Destroy all creatures with power 4 or greater.\n−7: You get an emblem with \"Creatures you control get +2/+2 and have flying.\"", 
    "type": "Planeswalker — Elspeth", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "W", 
      "B"
    ], 
    "colors": [
      "White", 
      "Black"
    ], 
    "imageName": "sorin, solemn visitor", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Khans of Tarkir Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{2}{W}{B}", 
    "name": "Sorin, Solemn Visitor", 
    "printings": [
      "KTK"
    ], 
    "rulings": [
      {
        "date": "2014-09-20", 
        "text": "Only creatures you control as the first ability resolves will get the bonuses. Creatures you come to control after that happens will not."
      }, 
      {
        "date": "2014-09-20", 
        "text": "When the emblem's ability resolves, if the player controls no creatures, the player won't sacrifice anything."
      }
    ], 
    "subtypes": [
      "Sorin"
    ], 
    "text": "+1: Until your next turn, creatures you control get +1/+0 and gain lifelink.\n−2: Create a 2/2 black Vampire creature token with flying.\n−6: You get an emblem with \"At the beginning of each opponent's upkeep, that player sacrifices a creature.\"", 
    "type": "Planeswalker — Sorin", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "U"
    ], 
    "colors": [
      "Blue"
    ], 
    "imageName": "jace, architect of thought", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Return to Ravnica Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{2}{U}{U}", 
    "name": "Jace, Architect of Thought", 
    "printings": [
      "RTR", 
      "DDM"
    ], 
    "rulings": [
      {
        "date": "2012-10-01", 
        "text": "Jace's first ability creates a delayed triggered ability that triggers whenever a creature an opponent controls attacks. It doesn't matter which player or planeswalker that creature is attacking."
      }, 
      {
        "date": "2012-10-01", 
        "text": "You pick one of your opponents when Jace's second ability resolves. The ability doesn't target that opponent. All players may see the revealed cards and offer opinions. You (not your opponent) choose which pile is put into your hand and which pile is put on the bottom of your library."
      }, 
      {
        "date": "2012-10-01", 
        "text": "Piles can be empty. If one of the piles is empty, you choose to put all the revealed cards in your hand or on the bottom of your library."
      }, 
      {
        "date": "2012-10-01", 
        "text": "When resolving Jace's third ability, you search each player's library (including yours) and exile the nonland cards before casting any of them."
      }, 
      {
        "date": "2012-10-01", 
        "text": "For each library, the search is complete only when you explicitly say it is. For example, you can look through one player's library, set that library down, look at another player's library, choose a nonland card in the first library, then choose a nonland card in the second library. Don't reveal any cards from those libraries to any other player until you exile them."
      }, 
      {
        "date": "2012-10-01", 
        "text": "You cast the cards by putting them on the stack one at a time, choosing modes, targets, and so on. The last card you cast will be the first one to resolve."
      }, 
      {
        "date": "2012-10-01", 
        "text": "When casting a card this way, ignore timing restrictions based on the card's type. Other timing restrictions, such as \"Cast [this card] only during combat,\" must be followed."
      }, 
      {
        "date": "2012-10-01", 
        "text": "If you can't cast a card, perhaps because there are no legal targets available, or if you choose not to cast one, it will remain exiled. Jace's ability won't allow you to cast it later."
      }, 
      {
        "date": "2012-10-01", 
        "text": "If you cast a card \"without paying its mana cost,\" you can't pay alternative costs such as overload costs. You can pay additional costs such as kicker costs. If the card has mandatory additional costs, you must pay those."
      }, 
      {
        "date": "2012-10-01", 
        "text": "If a card has {X} in its mana cost, you must choose 0 as its value."
      }
    ], 
    "subtypes": [
      "Jace"
    ], 
    "text": "+1: Until your next turn, whenever a creature an opponent controls attacks, it gets -1/-0 until end of turn.\n−2: Reveal the top three cards of your library. An opponent separates those cards into two piles. Put one pile into your hand and the other on the bottom of your library in any order.\n−8: For each player, search that player's library for a nonland card and exile it, then that player shuffles his or her library. You may cast those cards without paying their mana costs.", 
    "type": "Planeswalker — Jace", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 5, 
    "colorIdentity": [
      "W"
    ], 
    "colors": [
      "White"
    ], 
    "imageName": "gideon jura", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }, 
      {
        "format": "Zendikar Block", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 6, 
    "manaCost": "{3}{W}{W}", 
    "name": "Gideon Jura", 
    "printings": [
      "ROE", 
      "M12"
    ], 
    "rulings": [
      {
        "date": "2010-06-15", 
        "text": "Gideon Jura's first ability doesn't lock in what it applies to. That's because the effect states a true thing about a set of creatures, but doesn't actually change the characteristics of those creatures. As a result, whatever creatures the targeted opponent controls during the declare attackers step of his or her next turn must attack Gideon Jura if able. This includes creatures that come under that player's control after the ability has resolved and creatures that have lost all abilities."
      }, 
      {
        "date": "2010-06-15", 
        "text": "Gideon Jura's first ability causes creatures to attack him if able. If, during the affected player's declare attackers step, a creature he or she controls is tapped, is affected by a spell or ability that says it can't attack, or is affected by \"summoning sickness,\" then that creature doesn't attack. If there's a cost associated with having a creature attack, the player isn't forced to pay that cost, so the creature doesn't have to attack in that case either."
      }, 
      {
        "date": "2010-06-15", 
        "text": "If a creature controlled by the affected player can't attack Gideon Jura (because he's no longer on the battlefield, for example), that player may have it attack you, another one of your planeswalkers, or nothing at all."
      }, 
      {
        "date": "2010-06-15", 
        "text": "Gideon Jura's first ability applies during each combat phase of the affected player's next turn (as opposed to applying during the affected player's next combat phase). The distinction is relevant if there are no combat phases during that turn (due to Fatespinner's effect, for example) or there are multiples (due to World at War, for example)."
      }, 
      {
        "date": "2010-06-15", 
        "text": "If Gideon Jura becomes a creature due to his third ability, that doesn't count as having a creature enter the battlefield. Gideon Jura was already on the battlefield; he only changed his types. Abilities that trigger whenever a creature enters the battlefield won't trigger."
      }, 
      {
        "date": "2010-06-15", 
        "text": "If Gideon Jura becomes a creature, he may be affected by \"summoning sickness.\" You can't attack with him or use any of his {T} abilities (if he gains any) unless he began your most recent turn on the battlefield under your control. Note that summoning sickness cares about when Gideon Jura came under your control, not when he became a creature."
      }, 
      {
        "date": "2010-06-15", 
        "text": "Gideon Jura's third ability causes him to become a creature with the creature types Human Soldier. He remains a planeswalker with the planeswalker type Gideon. (He also retains any other card types or subtypes he may have had.) Each subtype is correlated to the proper card type: Gideon is just a planeswalker type (not a creature type), and Human and Soldier are just creature types (not planeswalker types)."
      }, 
      {
        "date": "2010-06-15", 
        "text": "If you activate Gideon Jura's third ability and then unpreventable damage is dealt to him (due to Unstable Footing, for example), that damage has all applicable results: specifically, the damage is marked on Gideon Jura (since he's a creature) and that damage causes that many loyalty counters to be removed from him (since he's a planeswalker). If the total amount of damage marked on Gideon Jura is lethal damage, he's destroyed as a state-based action. If Gideon Jura has no loyalty counters on him, he's put into his owner's graveyard as a state-based action."
      }, 
      {
        "date": "2010-06-15", 
        "text": "Say you activate Gideon Jura's third ability, then an opponent gains control of him before combat. You may have any of your creatures attack Gideon Jura (since he's still a planeswalker). Then Gideon Jura may block (since he's a creature). He may block any eligible attacking creature, including one that's attacking him! During combat, he behaves as an attacked planeswalker and/or a blocking creature, as appropriate. For example, he deals combat damage to any creatures he's blocking, but he doesn't deal combat damage to any unblocked creatures that are attacking him."
      }, 
      {
        "date": "2011-01-22", 
        "text": "The first ability only affects the declaration of attackers. If a creature is put onto the battlefield attacking (thanks to Hero of Bladehold, Preeminent Captain, or the Ninjutsu ability, for example), that creature's controller may choose the defending player or planeswalker that it will be attacking in the normal way."
      }
    ], 
    "subtypes": [
      "Gideon"
    ], 
    "text": "+2: During target opponent's next turn, creatures that player controls attack Gideon Jura if able.\n−2: Destroy target tapped creature.\n0: Until end of turn, Gideon Jura becomes a 6/6 Human Soldier creature that's still a planeswalker. Prevent all damage that would be dealt to him this turn.", 
    "type": "Planeswalker — Gideon", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 4, 
    "colorIdentity": [
      "G"
    ], 
    "colors": [
      "Green"
    ], 
    "imageName": "garruk wildspeaker", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Lorwyn-Shadowmoor Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{2}{G}{G}", 
    "name": "Garruk Wildspeaker", 
    "printings": [
      "pMEI", 
      "LRW", 
      "M10", 
      "DDD", 
      "M11", 
      "CMD", 
      "DD3_GVL"
    ], 
    "rulings": [
      {
        "date": "2009-10-01", 
        "text": "The first ability can target any two lands. They don't have to be tapped."
      }, 
      {
        "date": "2009-10-01", 
        "text": "The third ability affects only creatures you control at the time it resolves. It won't affect creatures that come under your control later in the turn."
      }
    ], 
    "subtypes": [
      "Garruk"
    ], 
    "text": "+1: Untap two target lands.\n−1: Create a 3/3 green Beast creature token.\n−4: Creatures you control get +3/+3 and gain trample until end of turn.", 
    "type": "Planeswalker — Garruk", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 3, 
    "colorIdentity": [
      "B", 
      "R"
    ], 
    "colors": [
      "Black", 
      "Red"
    ], 
    "imageName": "daretti, ingenious iconoclast", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{1}{B}{R}", 
    "name": "Daretti, Ingenious Iconoclast", 
    "printings": [
      "CN2"
    ], 
    "rulings": [
      {
        "date": "2016-08-23", 
        "text": "For the second ability, you choose the target artifact or creature as you activate the ability. You choose whether to sacrifice an artifact and which artifact to sacrifice as the ability resolves."
      }, 
      {
        "date": "2016-08-23", 
        "text": "For the last ability, if you choose an artifact on the battlefield as the target, and that artifact is no longer on the battlefield as the ability tries to resolve, the ability will be countered and none of its effects will happen. You won't get any tokens. This is true even if the card that represented that artifact is now in a graveyard. That card will be a different object than it was on the battlefield."
      }
    ], 
    "subtypes": [
      "Daretti"
    ], 
    "text": "+1: Create a 1/1 colorless Construct artifact creature token with defender.\n−1: You may sacrifice an artifact. If you do, destroy target artifact or creature.\n−6: Choose target artifact card in a graveyard or artifact on the battlefield. Create three tokens that are copies of it.", 
    "type": "Planeswalker — Daretti", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 5, 
    "colorIdentity": [
      "W", 
      "G"
    ], 
    "colors": [
      "White", 
      "Green"
    ], 
    "imageName": "ajani, mentor of heroes", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Theros Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 4, 
    "manaCost": "{3}{G}{W}", 
    "name": "Ajani, Mentor of Heroes", 
    "printings": [
      "JOU"
    ], 
    "rulings": [
      {
        "date": "2014-04-26", 
        "text": "You announce how many counters will be placed on each target creature as you activate Ajani's first ability. Each target must receive at least one counter."
      }, 
      {
        "date": "2014-04-26", 
        "text": "If one or more, but not all, of the targets of the first ability are illegal when that ability tries to resolve, no counters will be placed on illegal targets. You can't change the distribution you announced when you activated the ability; the excess counters are just lost."
      }
    ], 
    "subtypes": [
      "Ajani"
    ], 
    "text": "+1: Distribute three +1/+1 counters among one, two, or three target creatures you control.\n+1: Look at the top four cards of your library. You may reveal an Aura, creature, or planeswalker card from among them and put it into your hand. Put the rest on the bottom of your library in any order.\n−8: You gain 100 life.", 
    "type": "Planeswalker — Ajani", 
    "types": [
      "Planeswalker"
    ]
  }, 
  {
    "cmc": 3, 
    "colorIdentity": [
      "U", 
      "R"
    ], 
    "colors": [
      "Blue", 
      "Red"
    ], 
    "imageName": "saheeli rai", 
    "layout": "normal", 
    "legalities": [
      {
        "format": "Commander", 
        "legality": "Legal"
      }, 
      {
        "format": "Kaladesh Block", 
        "legality": "Legal"
      }, 
      {
        "format": "Legacy", 
        "legality": "Legal"
      }, 
      {
        "format": "Modern", 
        "legality": "Legal"
      }, 
      {
        "format": "Standard", 
        "legality": "Legal"
      }, 
      {
        "format": "Vintage", 
        "legality": "Legal"
      }
    ], 
    "loyalty": 3, 
    "manaCost": "{1}{U}{R}", 
    "name": "Saheeli Rai", 
    "printings": [
      "KLD"
    ], 
    "rulings": [
      {
        "date": "2016-09-20", 
        "text": "The token copies exactly what was printed on the original permanent and nothing else (unless that permanent is copying something else or is a token; see below). It doesn't copy whether that permanent is tapped or untapped, whether it has any counters on it or Auras and Equipment attached to it, or any non-copy effects that have changed its power, toughness, types, color, or so on."
      }, 
      {
        "date": "2016-09-20", 
        "text": "The token is an artifact in addition to its other types. This is a copiable value of the token that other effects may copy. Haste and the ability's delayed triggered ability aren't copiable."
      }, 
      {
        "date": "2016-09-20", 
        "text": "If the copied permanent has in its mana cost, X is considered to be 0."
      }, 
      {
        "date": "2016-09-20", 
        "text": "If the copied permanent is copying something else (for example, if the copied permanent is an Altered Ego), then the token enters the battlefield as whatever that permanent copied."
      }, 
      {
        "date": "2016-09-20", 
        "text": "If the copied permanent is a token, the token created with Saheeli copies the original characteristics of that token as stated by the effect that created that token."
      }, 
      {
        "date": "2016-09-20", 
        "text": "Any enters-the-battlefield abilities of the copied permanent will trigger when the token enters the battlefield. Any \"as [this permanent] enters the battlefield\" or \"[this permanent] enters the battlefield with\" abilities of the chosen permanent will also work."
      }, 
      {
        "date": "2016-09-20", 
        "text": "As Saheeli's last ability resolves, all three artifacts enter the battlefield at the same time. Triggered abilities of any of those artifacts will see all three entering the battlefield. Replacement effects, such as that of Sculpting Steel, won't see the others on the battlefield as they are being applied."
      }, 
      {
        "date": "2016-09-20", 
        "text": "In a Two-Headed Giant game, Saheeli's first ability causes 2 damage total to be dealt to the opposing team."
      }
    ], 
    "subtypes": [
      "Saheeli"
    ], 
    "text": "+1: Scry 1. Saheeli Rai deals 1 damage to each opponent.\n−2: Create a token that's a copy of target artifact or creature you control, except it's an artifact in addition to its other types. That token gains haste. Exile it at the beginning of the next end step.\n−7: Search your library for up to three artifact cards with different names, put them onto the battlefield, then shuffle your library.", 
    "type": "Planeswalker — Saheeli", 
    "types": [
      "Planeswalker"
    ]
  }
]